{
  "https://www.codepublishing.com/WA/AirwayHeights": [
    {
      "name": "   Single-Family Residential Zone (R-1)",
      "description": "17.06.010 Established. 17.06.020 Purpose and intent. 17.06.030 Permitted uses. 17.06.040 Conditional uses. 17.06.050 Prohibited uses.* 17.06.060 Development standards. 17.06.070 Density. 17.06.080 Minimum lot area and frontage. 17.06.090 Minimum yards. 17.06.100 Maximum building coverage and height. 17.06.110 Off-street parking. 17.06.120 Sign standards. 17.06.130 Fence and wall standards. 17.06.140 Landscaping standards. 17.06.150 Storage standards. There is established the R-1 single-family residential zone and the standards and regulations by which certain land uses may be permitted therein. (Ord. C-675 § 65, 2008) The purpose of the R-1 zone is to implement the lower density range of the residential category of the Comprehensive Plan. All proposals for rezoning shall be consistent with the goals and policies of the Comprehensive Plan. The intent and essential function of the R-1 zone is to provide for single-family, unattached dwelling uses. The R-1 zone is intended for an urban neighborhood setting with public services, improved streets, and public water and sewer systems. (Ord. C-675 § 66, 2008) The land uses permitted in the R-1 zone are listed in the zoning matrix and generally described as follows: A. Single-family, unattached dwellings, including manufactured homes constructed to meet all the requirements of the most recently enacted state and federal regulations regarding construction and maintenance of manufactured homes. The manufactured homes shall meet City of Airway Heights building code standards, and: 1. Must be a new manufactured home; 2. Is comprised of at least two fully enclosed parallel sections each of not less than 12 feet wide by 36 feet long; 3. Was originally constructed with and now has a composition or wood shake or shingle, coated metal, or similar roof of nominal 3:12 pitch; 4. Has exterior siding similar in appearance to siding materials commonly used on conventional site-built Uniform Building Code single-family residences; 5. The manufactured home be set upon a permanent foundation, as specified by the manufacturer, and that the space from the bottom of the home to the ground be enclosed by concrete or an approved concrete product which can be either load bearing or decorative; 6. The manufactured home complies with all local design standards applicable to all other homes within the neighborhood in which the manufactured home is to be located; 7. The home is thermally equivalent to the state energy code; and 8. The manufactured home otherwise meets all other requirements for a designated manufactured home as defined in RCW 35.63.160. B. Clustered single-family housing with an approved PUD overlay as provided in Chapter 17.17 AHMC. C. Adult family home, subject to the licensing and size limitation requirements of the state of Washington. D. Accessory Uses. 1. Private garage and carports; 2. Accessory sheds; 3. Outdoor patios; 4. Outdoor fireplaces; 5. Swimming pools; 6. Hot tubs. E. Secondary Uses. 1. Home profession as defined in Chapter 17.04 AHMC where public hearing review is not required. 2. Noncommercial gardening and fruit raising. 3. Family day care home when licensed by the Department of Social and Health Services of the state of Washington under the administrative policy of Chapter 388-155 WAC: a. Such homes shall comply with all building, fire safety, health codes and business licensing requirements and will require inspection by the City Building Official; b. Conform to lot size, building size, setbacks, and lot coverage standards applicable to the zoning district, except if the structure is a legal nonconforming structure; c. No structural or decorative alteration that will alter the single-family character of an existing or proposed residential structure or be incompatible with surrounding residences will be permitted. (Ord. C-959 § 1, 2021; Ord. C-956 § 3, 2021; Ord. C-675 § 67, 2008) In accordance with AHMC 17.03.100 through 17.03.140, the Hearing Examiner may grant approval for the following uses in the R-1 zone, when satisfied that the use will conform to the Comprehensive Plan and not have any reduction in levels of service as set in the Comprehensive Plan that cannot be mitigated, nor any negative impacts as determined by a SEPA checklist on neighboring properties that cannot be mitigated: A. Public buildings as defined in Chapter 17.04 AHMC, including a community hall, club or lodge, if it is related to the local community social activities and its principal activity includes a service customarily carried on as a business; B. Churches and auditoriums; C. Public and private schools; D. Parks and playgrounds; E. Day care centers when licensed by the Washington State Department of Social and Health Services; F. Home industry as defined in Chapter 17.04 AHMC; G. Conditional accessory dwelling units as provided in Chapter 17.24 AHMC; H. Special needs housing, including convalescent or nursing homes, that does not meet the definition of “adult family home,” and group homes. (Ord. C-956 § 4, 2021; Ord. C-675 § 68, 2008) The following uses are prohibited in the R-1 zone: A. Commercial uses, except home professions and home industry; B. Storage, other than storage of household materials used in construction for building on lot, and materials for home professions and home industry; C. Keeping of animals, livestock, poultry, except household pets, for personal enjoyment of the occupants, provided a total of five domestic household pets, more than one calendar year of age, shall be harbored, not to exceed three of each species; i.e., three dogs and two cats or three cats and two dogs, as defined in Chapter 17.04 AHMC; D. Recreational vehicles as defined in Chapter 17.04 AHMC may not be occupied; E. All other uses not specifically permitted are prohibited. (Ord. C-675 § 69, 2008) Before the issuance of a building permit, evidence of compliance with AHMC 17.06.070 through 17.06.150 shall be provided to the Planning Department. Any open space or park development mitigation shall be consistent with Chapter 16.09 AHMC and the City’s park plan. (Ord. C-675 § 70, 2008) The maximum density of dwelling units in the R-1 zone shall be five units per acre. Only one unit housing one family per lot shall be allowed unless a conditional accessory dwelling unit is approved per Chapter 17.24 AHMC. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 71, 2008) The minimum lot area for residential units in the R-1 zone shall be 7,200 square feet per unit, with 60-foot street frontage. If units are clustered in a PUD overlay zone, the minimum lot size shall be 5,500 square feet, with 50-foot street frontage. (Ord. C-675 § 72, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet; 4. Corner yard – 15 feet. B. Portable Structures. No temporary structure, garage, building shed, carport, gazebo, shipping container, tent, and/or air-supported structure shall be erected or maintained in the areas within the front or side yard setback requirements. One shed, with no foundation, that can be removed or detached within a reasonable amount of time to allow access by the Fire Department, with a maximum size to meet the minimum exempt level from the Building Department, shall be allowed within the back yard setback requirements. Except in the R-1 zone, utility sheds and garages will have a five-foot setback from the property line on the inside side yard and the rear yard. C. Decks, Porches and Awnings. Decks, porches and awnings will be permitted in the front yard setback provided the safety railing of the deck or porch is not less than 36 inches (from the deck floor) in height and not more than 48 inches in height; the deck or porch may have a roof built over it, as long as the drip line of the roof does not extend more than 10 feet from the front of the structure. They must meet building setbacks. Decks, porches and awnings are permitted in the back yard. The porch shall not be enclosed. (Ord. C-675 § 73, 2008) A. The maximum total building coverage shall be 50 percent of the lot area (35 percent for the dwelling unit). B. The maximum building height shall be 35 feet above the mean ground level. (Ord. C-675 § 74, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 75, 2008) Signage standards for uses in the R-1 zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. (Ord. C-675 § 76, 2008) Fence and wall standards for uses in the R-1 zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 77, 2008) Landscaping standards for uses in the R-1 zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. (Ord. C-675 § 78, 2008) Storage standards for uses in the R-1 zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. (Ord. C-675 § 79, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1706.html#17.06"
    },
    {
      "name": "   Manufactured Housing Residential Zone (RM)",
      "description": "17.07.010 Established. 17.07.020 Purpose and intent. 17.07.030 Permitted uses. 17.07.040 Conditional uses. 17.07.050 Prohibited uses.* 17.07.060 Development standards. 17.07.070 Density. 17.07.080 Minimum lot area and frontage. 17.07.090 Minimum yards. 17.07.100 Maximum building coverage and height. 17.07.110 Parking standards. 17.07.120 Sign standards. 17.07.130 Fence and wall standards. 17.07.140 Landscaping standards. 17.07.150 Storage standards. There is established the manufactured housing residential zone (RM) and the standards and regulations by which certain land uses may be permitted therein. (Ord. C-675 § 81, 2008) The function of the RM zone is to provide for unattached, manufactured (mobile) housing uses on individual lots and within manufactured home parks. The RM zone is designated to implement the single-family residential manufactured (mobile) housing category of the Comprehensive Plan. (Ord. C-675 § 82, 2008) The land uses permitted in the RM zone are listed in the zoning matrix and generally described as follows: A. Single-family manufactured (mobile) home parks which meet the specific standards outlined in Chapter 17.27 AHMC; B. Single-family manufactured (mobile) housing on individual lots, which meet the following standards: 1. Must be a new manufactured home; 2. Is comprised of at least two fully enclosed parallel sections each of not less than 12 feet wide by 36 feet long; 3. Was originally constructed with and now has a composition or wood shake or shingle, coated metal, or similar roof of nominal 3:12 pitch; 4. Has exterior siding similar in appearance to siding materials commonly used on conventional site-built Uniform Building Code single-family residences; 5. The manufactured home be set upon a permanent foundation, as specified by the manufacturer, and that the space from the bottom of the home to the ground be enclosed by concrete or an approved concrete product which can be either load bearing or decorative; 6. The manufactured home complies with all local design standards applicable to all other homes within the neighborhood in which the manufactured home is to be located; 7. The home is thermally equivalent to the state energy code; and 8. The manufactured home otherwise meets all other requirements for a designated manufactured home as defined in RCW 35.63.160. C. Accessory uses as allowed in the R-1 zone; however, no accessory structure shall contain more square footage than the primary dwelling unit; D. Secondary uses as allowed in the R-1 zone; E. Single-family, unattached dwellings. (Ord. C-959 § 2, 2021; Ord. C-675 § 83, 2008) In accordance with AHMC 17.03.110 through 17.03.140, the following uses may be permitted in the RM zone by the Hearing Examiner; provided, that if terms of this title will be complied with and that the use will conform to the Comprehensive Plan: A. All conditional uses permitted in the R-1 zone. (Ord. C-675 § 84, 2008) The following uses are prohibited in the RM zone: A. All uses prohibited in the R-1 zone. (Ord. C-675 § 85, 2008) Before the issuance of a building permit, evidence of compliance with AHMC 17.07.070 through 17.07.150 shall be provided to the Planning Department. Any open space or park development mitigation shall be consistent with Chapter 16.09 AHMC and the City’s park plan. (Ord. C-675 § 86, 2008) The maximum density of dwelling units on individual lots in the RM zone shall be seven dwelling units per acre. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 87, 2008) The minimum lot area for manufactured (mobile) homes on individual lots in the RM zone shall be 6,000 square feet, with 60-foot street frontage. (Ord. C-675 § 88, 2008) A. The minimum yards and setbacks for permitted and accessory uses in the RM zone shall be as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet; 4. Corner yard – 15 feet. B. Portable Structures. No temporary structure, garage, building shed, carport, gazebo, shipping container, tent, and/or air-supported structure shall be erected or maintained in the areas within the front or side yard setback requirements. One shed, with no foundation, that can be removed or detached within a reasonable amount of time to allow access by the Fire Department, with a maximum size to meet the minimum exempt level from the Building Department, shall be allowed within the back yard setback requirements. Except in the R-1 zone, utility sheds and garages will have a five-foot setback from the property line on the inside side yard and the rear yard. C. Decks, Porches and Awnings. Decks, porches and awnings will be permitted in the front yard setback provided the safety railing of the deck or porch is not less than 36 inches in height and not more than 48 inches in height; the deck or porch may have a roof built over it, as long as the drip line of the roof does not extend more than 10 feet from the front of the structure. They must meet building setbacks. Decks, porches and awnings are permitted in the back yard. The porch shall not be enclosed. (Ord. C-675 § 89, 2008) A. The maximum building coverage in the RM zone shall be 50 percent of the lot area (35 percent for the dwelling unit). B. The maximum height of buildings or structures in the RM zone shall be 35 feet above the mean ground level. (Ord. C-675 § 90, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 91, 2008) Signage standards for uses in the RM zone shall be as provided in Chapter 17.23 AHMC. (Ord. C-675 § 92, 2008) Standards for fences and walls in the RM zone shall be as provided in Chapter 17.20 AHMC. (Ord. C-675 § 93, 2008) Landscaping standards for uses in the RM zone shall be as provided in Chapter 17.22 AHMC. (Ord. C-675 § 94, 2008) Storage standards for uses in the RM zone shall be as provided in Chapter 17.25 AHMC. (Ord. C-675 § 95, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1707.html#17.07"
    },
    {
      "name": "   Duplex Residential Zone (R-2)",
      "description": "17.08.010 Established. 17.08.020 Purpose and intent. 17.08.030 Permitted uses. 17.08.040 Conditional uses. 17.08.050 Prohibited uses.* 17.08.060 Development standards. 17.08.070 Density. 17.08.080 Minimum lot area and frontage. 17.08.090 Minimum yards. 17.08.100 Maximum building coverage and height. 17.08.110 Off-street parking. 17.08.120 Sign standards. 17.08.130 Fence and wall standards. 17.08.140 Landscaping standards. 17.08.150 Storage standards. There is established the R-2 duplex residential zone and the standards and regulations by which certain land uses may be permitted therein. (Ord. C-675 § 97, 2008) The purpose of the R-2 zone is to implement the lower and medium density range of the residential category of the Comprehensive Plan. The intent and function of the R-2 duplex residential zone is to provide for single-family attached and unattached dwelling units, excluding manufactured (mobile) housing. The R-2 zone is intended for an urban neighborhood setting with public services, improved streets, and public water and sewer systems. (Ord. C-675 § 98, 2008) The land uses permitted in the R-2 zone are listed in the zoning matrix and are generally described as follows: A. All uses permitted in the R-1 zone, in accordance with the conditions and standards prerequisite thereto, except as are specifically established for the R-2 zone; B. Accessory uses as permitted in the R-1 zone; C. Secondary uses as permitted in the R-1 zone. (Ord. C-675 § 99, 2008) In accordance with AHMC 17.03.110 through 17.03.140, the following uses may be permitted in the R-2 zone by the Hearing Examiner, subject to such standards and conditions as the Hearing Examiner may determine; provided, that the terms of this title will be complied to and that the use will conform with the Comprehensive Plan: A. All conditional uses permitted in the R-1 zone. (Ord. C-675 § 100, 2008) The following uses are prohibited in the R-2 zone: A. All uses prohibited in the R-1 zone. (Ord. C-675 § 101, 2008) Before the issuance of a building permit, evidence of compliance with AHMC 17.08.070 through 17.08.150 shall be provided to the Planning Department. Any open space or park development mitigation shall be consistent with Chapter 16.09 AHMC and the City’s park plan. (Ord. C-675 § 102, 2008) The maximum density of dwelling units in the R-2 zone shall be 10 units per acre. One- and two-unit housing structures per individual lot shall be allowed. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 103, 2008) The minimum lot area for each duplex unit shall be 3,000 square feet, for a combined total of 6,000 square feet for both units with a minimum frontage of 30 feet per unit or at least 60 feet combined frontage. Single-family detached residential units in the R-2 zone shall be on a minimum lot size of 6,000 square feet per unit, with a minimum frontage of 60 feet per unit. If units are clustered in a PUD overlay zone, the minimum lot size shall be 5,000 square feet per structure (attached or unattached), with a minimum frontage of 50 feet per unit. (Ord. C-675 § 104, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet; 4. Corner yard – 15 feet. B. Portable Structures. No temporary structure, garage, building shed, carport, gazebo, shipping container, tent, and/or air-supported structure shall be erected or maintained in the areas within the front or side yard setback requirements. One shed, with no foundation, that can be removed or detached within a reasonable amount of time to allow access by the Fire Department, with a maximum size to meet the minimum exempt level from the Building Department, shall be allowed within the back yard setback requirements. C. Decks, Porches and Awnings. Decks, porches and awnings will be permitted in the front yard setback provided the safety railing of the deck or porch is not less than 36 inches (from the deck floor) in height and not more than 48 inches in height; the deck or porch may have a roof built over it, as long as the drip line of the roof does not extend more than 10 feet from the front of the structure. They must meet building setbacks. Decks, porches and awnings are permitted in the back yard. The porch shall not be enclosed. (Ord. C-675 § 105, 2008) A. The maximum total building coverage shall be 50 percent of the lot area (35 percent for the duplex dwelling unit structure. Duplex structures are defined as two units within one structure). B. The maximum building height shall be 35 feet above the mean ground level. (Ord. C-675 § 106, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 107, 2008) Signage standards for uses in the R-2 zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. (Ord. C-675 § 108, 2008) Fence and wall standards for uses in the R-2 zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 109, 2008) Landscaping standards for uses in the R-2 zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. (Ord. C-675 § 110, 2008) Storage standards for uses in the R-2 zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. (Ord. C-675 § 111, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1708.html#17.08"
    },
    {
      "name": "   Multiple-Family Residential Zone (R-3)",
      "description": "17.09.010 Established. 17.09.020 Purpose and intent. 17.09.030 Permitted uses. 17.09.040 Conditional uses. 17.09.050 Prohibited uses.* 17.09.060 Development standards. 17.09.070 Density. 17.09.080 Minimum lot area and frontage. 17.09.090 Minimum yards. 17.09.100 Maximum building coverage and height. 17.09.110 Off-street parking. 17.09.120 Sign standards. 17.09.130 Fence and wall standards. 17.09.140 Landscaping standards. 17.09.150 Storage standards. There is established the R-3 multiple-family residential zone and the standards and regulations by which certain land uses may be permitted therein. (Ord. C-675 § 113, 2008) The purpose of the R-3 zone is to implement the medium to high density range of the residential category of the Comprehensive Plan. The intent and primary function of the R-3 multiple-family residential zone is to provide for the location of multiple-family dwelling units at a medium to high density. The R-3 zone is intended for an urban neighborhood setting with a full range of public services. Multiple-family residential uses should be located along arterials of a collector or higher status, and should provide a transition from the higher intensity land uses to the single-family and duplex residential zones. (Ord. C-675 § 114, 2008) The land uses permitted in the R-3 zone are listed in the zoning matrix and generally described as follows: A. All uses permitted in the R-2 zone, in accordance with standards and regulations established thereto except as are specifically established for the R-3 zone; B. Apartment buildings and multiple dwellings; C. Adult family home; D. Accessory uses as allowed in the R-2 zone. (Ord. C-956 § 5, 2021; Ord. C-675 § 115, 2008) In accordance with AHMC 17.03.110 through 17.03.140, the following uses may be permitted in the R-3 zone by the Hearing Examiner, subject to such standards and conditions as the Hearing Examiner may determine; provided, that the terms of this title will be complied with and that the uses will conform to the Comprehensive Plan: A. All conditional uses permitted in the R-2 zone; B. Day care centers, licensed by the Washington State Department of Social and Health Services; C. Convalescent or nursing homes for the care of the aged, licensed by the appropriate state agency; D. Special needs housing, including convalescent or nursing homes, that does not meet the definition of “adult family home,” and group homes, licensed by the appropriate state agency. (Ord. C-956 § 6, 2021; Ord. C-675 § 116, 2008) The following uses are prohibited in the R-3 zone: A. All uses prohibited in the R-2 zone. (Ord. C-675 § 117, 2008) Before the issuance of a building permit, evidence of compliance with AHMC 17.09.070 through 17.09.150 shall be provided to the Planning Department. Any open space or park development mitigation shall be consistent with Chapter 16.09 AHMC and the City’s park plan. (Ord. C-675 § 118, 2008) The density range for dwelling units in the R-3 zone shall be 10 to 20 units per acre. Multiple-unit housing structures shall be encouraged in the R-3 zone. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 119, 2008) The minimum lot area for each duplex unit shall be 6,000 square feet, or 3,000 square feet per unit, with a minimum frontage of 30 feet per unit. A minimum lot size for multiple-family units other than duplexes shall not apply; however, 60 feet of frontage on a street such as a collector arterial or higher is required. If multiple-family units are clustered in a PUD overlay zone, the minimum lot size shall not apply, except a single-family unit or duplex/townhouse unit shall require a minimum lot size of 2,000 square feet per unit. (Ord. C-977 § 1, 2021; Ord. C-925 § 1, 2019; Ord. C-675 § 120, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet per story; 4. Corner yard – 15 feet. C. Portable Structures. No temporary structure, garage, building shed, carport, gazebo, shipping container, tent, and/or air-supported structure shall be erected or maintained in the areas within the front or side yard setback requirements. One shed, with no foundation, that can be removed or detached within a reasonable amount of time to allow access by the Fire Department, with a maximum size to meet the minimum exempt level from the Building Department, shall be allowed within the back yard setback requirements. D. Decks, Porches and Awnings. Decks, porches and awnings will be permitted in the front yard setback provided the safety railing of the deck or porch is not less than 36 inches (from the deck floor) in height and not more than 48 inches in height; the deck or porch may have a roof built over it, as long as the drip line of the roof does not extend more than 10 feet from the front of the structure. They must meet building setbacks. Decks, porches and awnings are permitted in the back yard. The porch shall not be enclosed. (Ord. C-675 § 121, 2008) A. The maximum building coverage shall be 50 percent of the lot area. B. The maximum building height shall be 35 feet above the mean ground level. (Ord. C-675 § 122, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 123, 2008) Signage standards for uses in the R-3 zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. (Ord. C-675 § 124, 2008) Fence and wall standards for uses in the R-3 zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 125, 2008) Landscaping standards for uses in the R-3 zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. (Ord. C-675 § 126, 2008) Storage standards for uses in the R-3 zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. (Ord. C-675 § 127, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1709.html#17.09"
    },
    {
      "name": "   Commercial Zones",
      "description": "17.10.010 Purpose and intent. 17.10.020 Commercial districts. 17.10.030 Design standards and guidelines. 17.10.040 Allowed uses. 17.10.050 Floor area ratios (FAR). 17.10.060 Maximum building height. 17.10.070 Setbacks and required sidewalk width. 17.10.080 Parking and loading. 17.10.090 Landscaping and screening. 17.10.100 Fences. 17.10.110 Signs. 17.10.120 Relationship to AICUZ. The intent of these commercial district regulations is to implement the goals and policies of the Comprehensive Plan, the downtown plan, and the US 2 corridor plan. These areas are intended to bring employment, shopping, civic, recreational, and residential activities along the US 2 corridor and in emerging commercial nodes. New development and redevelopment is encouraged in these districts to promote a relatively cohesive development pattern with a mix of uses, higher density housing, buildings oriented to the street, screened parking areas behind buildings, alternative modes of transportation with a safe pedestrian environment, quality design, smaller blocks and relatively narrow streets with on-street parking. (Ord. C-962 § 12, 2021) A. C-1 Downtown. The intent of the C-1 downtown zone is to facilitate development of an identity-rich, mixed-use, and compact downtown environment. Whether located along US 2 or at the core of another smaller commercial district, the C-1 zone is intended to create and sustain an environment of commercial vitality, pedestrian movement, civic activity, a mix of housing types, and social interaction. This district implements the Comprehensive Plan’s commercial land use designation. This zone promotes the greatest pedestrian orientation of the City’s commercial zones. To accomplish this, some limitations are placed on auto-oriented activities and some types and the allowable size of some uses are controlled. B. C-1A Downtown Transition. The intent of the C-1A downtown transition zone is to facilitate development in those places along the US 2 corridor near the C-1 zone that manage the transition between a corridor focused on highway access and the slower-paced downtown district. Development and land use in this zone shall more closely approach the roadway edge, place less emphasis on parking lots, add architectural detail and be more accommodating of pedestrian movement than development in the C-2 zone, contributing to a visual environment that slows speed on US 2 as travelers approach the C-1 zone. Development in this zone may have a greater emphasis on ground-floor residential uses, offer more surface parking and rely more on direct highway access than development in the C-1 zone. It promotes new development and redevelopment that is pedestrian-oriented while also accommodating the automobile. C. C-2 Highway Corridor. The intent of the C-2 highway corridor zone is to permit large-scale development reliant on highway access and visibility, where uses benefit from high vehicular trip counts and cater to drivers of private vehicles by providing visible, convenient parking and a range of retail, institutional, office, civic, recreational, and residential uses to meet the community’s needs. While the priority of this zone is to emphasize vehicular access, public transportation, pedestrians, and cyclists are also served, with dedicated, safe facilities. (Ord. C-962 § 13, 2021) All development in the C-1, C-1A, and C-2 districts shall address the pertinent design standards and guidelines. A. Administration and Interpretation. This section assigns standards related to site plan and building design and shall be interpreted by staff as part of land use permit or building permit review, as appropriate. Building plans shall be submitted in sufficient detail to permit accurate staff review of these provisions, including, but not limited to, site plans and exterior elevations as required by AHMC 14.03.030. An applicant may seek relief by the Technical Review Committee, provided alternative design enhancements are proposed in place of those requirements not able to be met. B. Ground Floor Windows. These provisions apply to nonresidential building facades between two feet and 10 feet above the level of the adjacent sidewalk, walkway or ground level. 1. A minimum of 50 percent of any ground floor nonresidential building facade that is visible from and located within 20 feet of the lot line of an arterial street designated on the arterial street plan shall be comprised of windows with clear, “vision” glass allowing views into the interior. Display windows may be used to meet half of this requirement. 2. A minimum of 30 percent of any ground floor nonresidential building facade that is visible from, fronting on, and located within 60 feet of the lot line of an arterial street designated on the arterial street plan shall be comprised of windows with clear, “vision” glass allowing views into the interior. Display windows may be used to meet half of this requirement. 3. For portions of facades that do not have windows, see guidelines for treating blank walls, subsection (H) of this section. C. Facade Detail. 1. Buildings shall have a distinct “base” at the ground level, using articulation and materials such as stone, masonry, or decorative concrete. 2. The “top” of the building shall be treated with a distinct outline with elements such as a projecting parapet, cornice, or projection. D. Articulation. 1. Facades longer than 50 feet shall be broken down into smaller units through the use of offsets, recesses, staggered walls, stepped walls, pitched or stepped rooflines, overhangs and other elements of the building’s mass. Simply changing materials or color is not sufficient to accomplish this. 2. Articulation shall be provided along facades visible from the street, as well as from neighboring residential areas. E. Prominent Entrance. Principal building entries shall be marked by at least one element from Group A and one element from Group B: 1. Group A. a. Large entry doors. b. Recessed entrance. c. Protruding entrance. 2. Group B. a. Canopy. b. Portico. c. Overhang. F. Ground Level Details. 1. Ground level of building shall be pedestrian-friendly in scale, expression and use of materials. 2. Ground floor of the buildings shall have at least three of the following elements: a. Large windows. b. Ground-level detailing for storefront windows. c. Projecting sills. d. Pedestrian scale signs. e. Canopies. f. Plinths. 3. Weather protection, in the form of awnings, overhang, panels, or canopies, shall be installed over display windows, doors, and entryways, shall project from the face of the building no less than 60 inches, and shall have a minimum eight-foot clearance from the sidewalk. G. Roof Expression. Buildings with flat roofs shall have portions with pitched roofs, extended parapets, or projecting cornices to create a prominent edge when viewed against the sky, especially to highlight major entrances. H. Treating Blank Walls. Where windows are not provided on walls (or portions of walls) facing streets or visible from right-of-way, at least four of the following elements shall be incorporated: 1. Masonry (but not flat concrete block). 2. Concrete or masonry plinth at wall base. 3. Belt courses of a different texture and color. 4. Projecting cornice. 5. Projecting metal canopy. 6. Decorative tilework. 7. Trellis containing planting. 8. Medallions. 9. Opaque or translucent glass windows. 10. Artwork such as sculptures, murals, inlays, mosaics, or elements integrated with the project. 11. Vertical articulation. 12. Lighting fixtures. 13. Recesses. 14. An architectural element not listed above, as approved, that meets the intent of this section. I. Plazas and Other Open Spaces. 1. New or renovated buildings over 40,000 square feet shall have plazas, courtyards or other pedestrian spaces at or near their main entrances. 2. Plazas and other open spaces shall be a minimum of one square foot of plaza per 100 square feet of building area. This area may count toward the interior landscaping required. 3. Plazas, courtyards and other pedestrian space shall include at least three of the following: a. Special interest landscape. b. Pedestrian scale bollard or other accent lighting. c. Special paving, such as colored/stained concrete, brick or other unit paver. d. Artwork. e. Seating, such as benches, tables, or low seating walls. f. Water feature. J. Building Location. In the C-1 zone, buildings shall be located on the front property line along US 2, 14th Ave, and 6th Ave adjacent to the sidewalk, with the following exceptions allowed: 1. Buildings may be set back from the front property line the minimum distance necessary to allow space for the construction of a 10-foot-wide public sidewalk. 2. Buildings may be set back to allow for outdoor seating, small item or public art display areas, additional pedestrian circulation, or other public purpose not devoted to automobile circulation. K. Parking Lots. In the C-1 zone, surface parking shall observe the following location standards and otherwise comply with provisions of Chapter 17.21 AHMC: 1. Parking lots shall not be located between buildings and US 2, 14th Ave or 6th Ave. 2. Access to parking lots (driveways) shall not be from US 2, 14th Ave or 6th Ave if another option, such as an alley, is available. L. Mixed Uses. Mixed-use development shall observe the following design standards and otherwise comply with the development standards specified in underlying zoning districts: 1. Ground-floor ceiling height for mixed-use buildings shall be no less than 14 feet from finished floor. 2. Mixed-use developments shall be a minimum of two stories in height. 3. No residential use shall be permitted to be located along the street edge. 4. Sound mitigation shall be required if a proposed project is located within a 65-CNEL or higher sound contour, such that the decibel level produced by exterior noise sources is reduced by a minimum of 25 dB noise-level-reduction when heard from the interior of the structure. 5. Parking requirements for mixed-use developments may be reduced in accordance with Chapter 17.21 AHMC and allowances for shared or complementary parking. 6. Metal siding, metal pole buildings, and manufactured housing shall not be permitted in mixed-use projects. 7. Mixed-use projects shall provide enclosures for recyclable and garbage collection points, as outlined in Chapter 17.25 AHMC. (Ord. C-962 § 14, 2021) The uses allowed in the C-1, C-1A, and C-2 zones are shown in Table 17.10.040. This table is to be used in conjunction with Table 1 in Chapter 17.05 AHMC and the definitions in Chapter 17.04 AHMC to assure accurate classification of uses. Additional information about permitted uses in aircraft accident potential areas or in areas where noise contours exceed 65 CNEL is provided in Chapter 17.16 AHMC, JLUS Protections for Fairchild Air Force Base. A. Administration and Interpretation. The Director or designee shall review proposed development applications and determine their appropriateness for location in the applicable zoning districts in accordance with AHMC 14.02.020 and 17.05.030. This is a guide that requires application of Chapter 17.04 AHMC, Definitions, Chapter 17.05 AHMC, Zone Classifications, Map, and Matrix, and Chapter 17.16 AHMC, JLUS Protections for Fairchild Air Force Base. B. Types of Permits. 1. Permitted (P). Uses identified as permitted may be allowed subject to the standards of the zoning ordinance and other applicable provisions of the AHMC. 2. Not Permitted (N). Uses identified as not permitted may not be allowed to locate in the zoning district where the use is not permitted. 3. Permitted with Limitations (L). Uses identified as permitted with limitations may locate in the appropriate zoning districts provided they comply with special regulations or design standards to ensure compatibility with surrounding uses and consistency with Airway Heights’ policy. The Director or designee will evaluate each application for compliance with applicable special regulations or design standards. 4. Conditionally Permitted (C). Uses identified as conditionally permitted may be permitted subject to issuance of a conditional use permit in accordance with Chapter 14.03 AHMC. P – Permitted | N – Not permitted | L – Permitted with limitations | C – Conditionally permitted To determine the allowed gross floor area of all buildings or structures allowed on a site, the FAR in Table 17.10.050 is multiplied by the area of the lot. Exceptions. A. Hotels and motels (including bed and breakfast inns) are considered residential uses for the purpose of FAR. B. Exclusions from Floor Area Calculations. 1. Floor area dedicated to parking. 2. Elevators, staircases, escalators and mechanical spaces. 3. Exterior decks, porches and arcades open to the air. 4. Floor area dedicated to public amenities. (Ord. C-962 § 16, 2021) Table 17.10.060 sets forth the maximum building and structure heights for each zone. Each structure, development or activity shall comply with these requirements except as otherwise provided in this chapter. Regardless of minimum setback, buildings shall be no closer than 12 feet from the face of the curb and shall always be constructed on private property. A. Sidewalks shall be at least 12 feet wide and consist of a clear walking path at least eight feet wide (in addition to a planting zone for street trees). B. This width may be reduced, by approval of the Technical Review Committee, if the existing sidewalk is less than 12 feet wide between the face of curb and the existing building setback line of adjacent building(s). In no case shall the setback be reduced below nine feet from the face of the curb, unless on-street parking exists between the building and the street. In that instance, the sidewalk shall maintain a clear walking path of at least seven feet wide. C. Minimum setback standards measured from the property line are found in Table 17.10.070. The standards pertaining to the minimum required and maximum allowed number of auto parking spaces, minimum required number of bicycle parking spaces, parking lot placement, parking lot setbacks, and internal parking lot pedestrian connections are stated in Chapter 17.21 AHMC, Parking and Loading. (Ord. C-962 § 19, 2021) The standards for landscaping and screening are stated in Chapter 17.22 AHMC, Landscaping. (Ord. C-962 § 20, 2021) A. Purpose. The fence standards promote the positive benefits of fences without adversely impacting the community or endangering public or vehicle safety. Fences near streets are kept low to allow visibility into and out of the site and to ensure visibility for motorists. Fences in any required side or rear setback are limited in height not to conflict with the purpose for the setback. B. Type of Fences. The standards apply to walls, fences, and screens of all types whether open, solid, wood, metal, wire, masonry, or other material. C. Location, Height, and Design. 1. Street Setbacks. No fence or other structure is allowed within 12 feet from the face of the curb, consistent with the required sidewalk width of AHMC 17.10.070. 2. Measured from Front Lot Line. Fences up to three and one-half feet high are allowed in a required street setback that is measured from a front lot line. 3. Measured from a Side Lot Line. Fences up to six feet high are allowed in a required setback that is measured from a side lot line. 4. Fences shall not reduce the required setback width of AHMC 17.10.070. D. Side or Rear Structure Setbacks. Fences up to six feet high are allowed in required side or rear setbacks except when the side or rear setback abuts a pedestrian connection. When the side or rear setback abuts a pedestrian connection, fences are limited to three and one-half feet in height. E. Not in Setbacks. The height for fences that are not in required setbacks is the same as the regular height limits of the zone. F. Sight-Obscuring Fences and Walls. Any sight-obscuring fences, walls, and other structures over three and one-half feet high and within 15 feet of a street lot line shall either be placed on the interior side of an L2 see-through buffer landscaping area at least five feet in depth (See Chapter 17.22 AHMC, Landscaping), or meet the treatment of blank walls intent outlined in AHMC 17.10.030(H). G. Prohibited Fences. 1. No person may erect or maintain a fence or barrier consisting of or containing barbed, razor, concertina, or similar wire. 2. No person may maintain a fence or barrier charged with electricity. 3. A fence, wall, or other structure shall not be placed within a public right-of-way without an approved covenant as provided in Chapter 17.20 AHMC and any such structure is subject to the height requirement for the adjoining setback. 4. No fence may be closer than 12 feet to the curb. H. Visibility at Intersections. 1. A fence, wall, hedge or other improvement shall conform to Chapter 17.22 AHMC and shall not be erected or maintained at the corner of a lot so as to obstruct the view of travelers upon the streets. 2. Subject to the authority of the traffic engineer to make adjustments and special requirements in particular cases, all fences, vegetation, and other features within the clear view triangle defined in Chapter 17.19 AHMC shall be maintained to keep a vertical clear view zone between three and eight feet from ground level. I. Enclosures for Pools, Hot Tubs, or Ponds. 1. A person maintaining a swimming pool, hot tub, pond or other impoundment of water exceeding 5,000 gallons and 18 inches or more in depth and located on private property is required to construct and maintain an approved fence by which the pool or water feature is enclosed and inaccessible by small children. 2. The required pool enclosure must be at least 54 inches high and may be a fence, wall, building, or other structure approved by the Building Services Department. 3. If the enclosure is a woven wire fence, it is required to be built to discourage climbing. 4. No opening, except a door or gate may exceed four inches in any dimension. 5. Any door or gate in the pool enclosure, except when part of the occupied dwelling unit, must have self-closing and self-locking equipment by which the door or gate is kept secure when not in use. A latch or lock release on the outside of the door or gate must be 54 inches above the ground. 6. Outside of the door or gate must be at least 54 inches above the ground. J. Reference to Other Standards. Building permits are required by the Building Services Department for all fences including the replacement of existing fences. A permit is not required to repair an existing fence. (Ord. C-962 § 21, 2021) Sign standards are stated in Chapter 17.23 AHMC for all land within commercial zones, except that no pole signs shall be permitted in the C-1 zone. (Ord. C-962 § 22, 2021) Land use, building height and intensity limitations may be imposed by the air installation compatibility use zone requirements, found in Chapter 17.16 AHMC. (Ord. C-962 § 23, 2021)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1710.html#17.10"
    },
    {
      "name": "   Light Industrial Zone (I-1)",
      "description": "17.12.010 Purpose and intent. 17.12.020 Permitted uses. 17.12.030 Conditional uses. 17.12.040 Prohibited uses. 17.12.050 Development standards. 17.12.060 Density. 17.12.070 Minimum lot area and frontage. 17.12.080 Minimum yards. 17.12.090 Building coverage and height. 17.12.100 Parking standards. 17.12.110 Sign standards. 17.12.120 Fence and wall standards. 17.12.130 Landscaping standards. 17.12.140 Storage standards. The purpose and intent of the light industrial zone (I-1) is to implement the industrial category of the Comprehensive Plan. The light industrial zone provides a location for high technology industrial and incidental commercial uses of a light intensity, which has minimal environmental impacts. Restrictive development standards of this zone are intended to result in a clean, quiet industrial development, with primary activities conducted in enclosed buildings. Developments in this zone are characterized by parklike grounds and attractive buildings, which are compatible with nearby residential and commercial land uses. In the light industrial zone, no building or premises shall be used nor any building or structure hereafter erected or altered unless otherwise provided in this chapter. (Ord. C-675 § 159, 2008) Land uses permitted in the I-1 zone are listed in the zoning matrix. Any land or buildings in the light industrial zone may hereafter be used, or may be constructed to be used, for industrial uses and those commercial uses allowed in the C-2 zone, except for those commercial uses only permitted in the C-1 zone. The City Planner and Code Enforcement Officer are to determine if compatibility exists between uses. Industrial uses are the uses of land and buildings for manufacturing, processing, fabrication, assembly, freight handling, or similar operations. In the light industrial zone, all industrial operations shall: A. Be carried on in such a manner and with such precautions against fire and explosion hazards as to be acceptable to the City Fire Chief or designee; B. Store all raw materials, finished products, machinery, and equipment, including company-owned or -operated trucks and motor vehicles, within an entirely closed building or sight-obscuring, nonpierced fence not less than six feet in height. Liquids shall be stored in underground tanks in accordance with uniform standards prescribed by the City Fire Chief or designee and the fire district concerned; C. Emit no obnoxious odors of any kind; D. Exhaust no waste into the air or dust created by industrial operation; E. Discharge no treated or untreated sewage or industrial waste into any surface water or onto open ground. All methods of sewage and industrial waste treatment and disposal shall be approved by the Spokane County Regional Health District, and shall meet the requirements of the Spokane County Air Pollution Control Authority; F. Carry on no operation that would produce heat or glare perceptible from any property line of the lot on which the industrial operation is located; G. Use no industrial and exterior lighting in a manner that produces glare on public highways and neighboring property; H. Conduct no mining, extracting, filling, or soil-stripping operations; I. Use only oil, gas, or electricity as industrial fuel; J. Conform to the most recent City ordinance concerning noise levels. (Ord. C-675 § 160, 2008) In accordance with AHMC 17.03.110 through 17.03.140, the Hearing Examiner may grant approval for certain conditional uses listed on the zoning matrix in the I-1 zone, when satisfied that the use will be consistent with the Comprehensive Plan and the intent of the I-1 zone, and when the conditional use will not have a material adverse effect on neighboring properties. In granting such approval, the Hearing Examiner may require special restrictions such as sight-obscuring fences, suitable landscaping, yard requirements, signs, etc., and may also require time limits for the proposed use. Mitigation restrictions for the suppression of noise, smoke, or odors may be required. (Ord. C-675 § 161, 2008) Prohibited uses in the restricted industrial zone include, but are not limited to, the following: A. Cemeteries; B. Public and parochial schools, general hospitals, sanitariums, and churches; C. Slaughterhouses; stockyards; fat rendering; soap manufacture; glue manufacture; tannery; paper manufacture; wool scouring and cleaning; cotton textile sizing, scouring, bleaching, dyeing and similar uses; varnish manufacture; and creosote and creosote products manufacture; D. The production of corrosive and noxious chemicals including, but not limited to, acids, acetylene gas, ammonia, chlorine, and bleaching compound; E. The production and processing of coal and coal tar, the processing of petroleum and petroleum products, the aboveground storage of petroleum products, and petroleum refining; F. The extraction, preparation, and processing of dust-producing mineral products, including, but not limited to, abrasives, cement, lime, fertilizer, plaster, crushed stone, and the mining of sand, gravel, or topsoil; G. The smelting and reduction of metallic ores including, but not limited to, blast furnaces; open hearth, electrical furnaces; Bessemer converters; and nonferrous metal smelters; H. The manufacture and storage of explosive products, including, but not limited to, dynamite and commercial explosives, TNT, military explosives, and fireworks; I. Auto wrecking yards and the storage of junk; J. General residential uses. (Ord. C-675 § 162, 2008) Before the issuance of a building permit, evidence of compliance with AHMC 17.12.060 through 17.12.140 shall be provided to the Planning Department. (Ord. C-675 § 163, 2008) No density requirements apply in the I-1 zone, except for those areas within the Fairchild Air Force Base accident potential zones defined in Chapter 17.16 AHMC. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 164, 2008) A minimum lot size of 15,000 square feet shall apply in the I-1 zone. A minimum street frontage of 100 feet is required. (Ord. C-675 § 165, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 35 feet from the property line or 65 feet from the centerline; 2. Rear yard – 15 feet; 3. Side yard – five feet per story except for attached buildings; 4. Corner yard – 25 feet from the property line or 55 feet from the centerline. B. The Technical Review Committee may alter these setback guidelines if a design is proposed that differs from these standards, but still provides the same level of safety and aesthetics as intended by these setbacks. (Ord. C-675 § 166, 2008) A. The maximum building coverage shall be 60 percent of the lot area. B. No building hereafter erected or structurally altered in a restricted industrial zone shall exceed three stories or a maximum height of 50 feet above the mean ground level. (Ord. C-675 § 167, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 168, 2008) Signage standards for uses in the I-1 zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. (Ord. C-675 § 169, 2008) Fence and wall standards for uses in the I-1 zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 170, 2008) Landscaping standards for uses in the I-1 zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. (Ord. C-675 § 171, 2008) Storage standards for uses in the I-1 zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. (Ord. C-675 § 172, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1712.html#17.12"
    },
    {
      "name": "   Heavy Industrial Zone (I-2)",
      "description": "17.13.010 Purpose and intent. 17.13.020 Permitted uses. 17.13.030 Conditional uses. 17.13.040 Prohibited uses. 17.13.050 Development standards. 17.13.055 Reclamation plan required outside the aquifer sensitive area. 17.13.060 Density. 17.13.070 Minimum lot area and frontage. 17.13.080 Minimum yards. 17.13.090 Building coverage and height. 17.13.100 Parking standards. 17.13.110 Sign standards. 17.13.120 Fence and wall standards. 17.13.130 Landscaping standards. 17.13.140 Storage standards. 17.13.150 Fire hazards. 17.13.160 Industrial waste. The purpose and intent of the heavy industrial (I-2) zone is to implement the industrial category of the Comprehensive Plan. Most heavy industrial land uses are intense by nature and present compatibility issues; therefore, the heavy industrial area should be primarily located south of Highway 2. In the I-2 zone, no building or premises shall be used nor shall any building or structure be hereafter erected or altered unless otherwise provided in this chapter. (Ord. C-675 § 174, 2008) Land uses permitted in the I-2 zone are listed in the zoning matrix. Permitted uses include any trade, industry, processing activity, commercial activity, or other use with frontage on a public street and in accordance with the standards and requirements established in this title, other applicable legislation, and official regulations promulgated by a public agency having jurisdiction except as specifically prohibited in AHMC 17.13.040. The City Planner and Code Enforcement Officer are to determine if compatibility exists between uses. (Ord. C-675 § 175, 2008) In accordance with AHMC 17.03.110 through 17.03.140, the Hearing Examiner may grant approval for the following uses in the I-2 zone, when satisfied that the use will be in harmony with the Comprehensive Plan and the intent of the I-2 zone, and when the conditional use will not have a material adverse effect on neighboring properties. In granting such approval, the Hearing Examiner may require special site mitigations, such as sight-obscuring fences, suitable landscaping, yard requirements, signs, etc., and may also require time limits for the proposed use. Any reasonable restrictions for the suppression of noise, smoke, expansion of an existing conditional use, or odors may also be required: A. Auto wrecking and salvage yard; B. Junkyard; C. Temporary workspace, including manufactured (mobile) homes, for custodial and security personnel; if occupancy is limited to no more than 12 hours in a 24-hour period for any employees. This workspace shall not be used for a residence; D. Full service restaurants, taverns, dance halls, bingo parlors, and other assemblies without fixed seating; E. Custodial quarters; F. Mining/quarrying; G. Concrete/asphalt batching. (Ord. C-725 § 3, 2010; Ord. C-675 § 176, 2008) In the I-2 zone, prohibited uses include, but are not limited to, the following: A. Single-family, manufactured (mobile) homes, and other multiple-family dwellings; B. Cemeteries; C. Institutions or homes for the treatment or convalescence of persons, children, aged persons, alcoholics, the wounded, or the mentally infirm; D. Hotels; E. Motels and auto courts; F. Public and parochial schools, except trade schools; G. Manufactured (mobile) home parks; H. Recreational vehicles as defined in Chapter 17.04 AHMC; I. Kennels; J. Sanitary landfills, garbage and refuse dumps; K. Slaughterhouses; rendering plants; fat rendering; livestock feed yard; livestock sales yard; commercial riding academy; stockyards; soap manufacturing; glue manufacturing; tannery; paper manufacturing; wood scouring and cleaning; cotton textile sizing, scouring, bleaching, dyeing and similar uses; varnish manufacturing; creosote and creosote products manufacturing; and fertilizer manufacturing; L. Disposal of offal or dead animals; M. The production of corrosive and noxious chemicals including, but not limited to, acids, acetylene gas, ammonia, chlorine, and bleaching compounds; N. The production and processing of coal and coal tar, the processing of petroleum and petroleum products, and petroleum refining; O. The manufacture and storage of explosive products, including, but not limited to, dynamite and commercial explosives, TNT, military explosives, and fireworks; P. Churches and auditoriums. (Ord. C-725 § 4, 2010; Ord. C-675 § 177, 2008) A. Before the issuance of a building permit, evidence of compliance with AHMC 17.13.060 through 17.13.140 shall be provided to the Planning Department. B. Development standards for mining/batching activities outside the aquifer sensitive area. Additional restrictions or mitigations may be required by the Hearing Examiner, depending on the specific application, including but not limited to: 1. A geotechnical/hydrological report of the site and surrounding area is required before mining, in order to properly assess water availability and mitigate water quality impacts; 2. The owner/operator shall comply with all existing water quality monitoring regulations of the State Department of Ecology and the Spokane County Regional Health District; 3. Before commencement of mining activity, evidence of compliance with the following standards must be provided to the Planning Department. Each proposed mining operation must adequately address all requirements to the satisfaction of the Planning Director: a. The minimum site area of land within a mining zone shall be five acres. There is no minimum frontage requirement, but access approval and permits must be obtained from appropriate agencies; b. Mining and quarrying shall be permitted up to within 50 feet of any property line; provided, all provisions set forth are complied with; and provided further, that such mining or quarrying does not impair lateral or subjacent support or cause earth movements or erosion to extend into this 50-foot setback or beyond. Whenever a mining or quarry operation is located adjacent to another mining or quarry operation, the mining or quarry operation may be permitted up to the property line to meet or improve the reclamation objectives; c. No mining/batching activities shall occur within 300 feet of any residentially zoned properties; d. Structures or buildings in a mining zone shall not be located closer than 100 feet from a primary residential zone; e. Whenever mining zone property, developed for the mining or quarrying of minerals or materials, has a common property line with a primary residential zone established before establishing the mining use, there shall be installed and maintained a sight-obscuring screen. Acceptable methods of screening shall include, but not be limited to, fencing, berm, and landscaping. Planting screens shall be a minimum of 10 feet in width, be maintained and planted in good soil, irrigated as necessary, and maintained in good condition until operations on site cease and rehabilitation of the site is completed. Installation of plantings shall result in healthy plants capable of achieving the screening intent of this section. All material shall conform to the guidelines established by the current American Standard for Nursery Stock, published by the American Association of Nurserymen. Such sight-obscuring fence, berm, and landscaping required shall be installed as a yard improvement at or before the time mining or quarrying operations commence or within 60 days. The fence, berm, and landscaping shall be installed and maintained at the expense of the owner or lessee of the mining zoned property; f. Fencing shall be provided for the City of Airway Heights and maintained by the owner/operator in good condition at all times in the following locations: g. A protective eight-foot-high berm or other provisions may be required adjacent to property lines where the edge of the pit is within 100 feet of a street or railroad right-of-way; h. Sound pressure levels, as measured on properties adjacent to property in a mining zone, shall conform, at a minimum, to the provisions of WAC 173-60-040, Maximum Permissible Environmental Noise Levels, for noise originating in a Class C EDNA (industrial zone); 4. Provisions of the Spokane County Clean Air Authority shall be adhered to in the development of mining properties; 5. A mining and reclamation plan must be submitted and approved by the Washington State Department of Natural Resources under the provisions of Chapter 78.44 RCW, Surface Mining, with City approval of the subsequent use. In addition to the information requested in the mining and reclamation plan, anticipated days, hours and duration of operation must be addressed; 6. All necessary and required access permits, including a haul route agreement with the City of Airway Heights, shall be obtained before commencement of the mining use; 7. All permits/applications filed with the Department of Natural Resources, SCRCAA, Spokane County Health District, the Department of Ecology, the City of Airway Heights, and any other related organization or agency; 8. Approved bonds or other performance securities as required by the Department of Natural Resources; 9. A minimum of 10 feet above the highest known aquifer elevation shall be maintained in the mining pit area. Stringent regulations of all agencies of jurisdiction shall apply; 10. A drainage channel shall be constructed around the active gravel pit area to keep surface run-off from outside the pit excavation from entering the pit area; 11. Fuel storage areas and service facilities shall incorporate provisions to prevent lubricants and petroleum products from contaminating either the pit area or drainage channels by such means as a secondary storage container capable of containing potential pollutants; 12. No liquid-asphalt, cement, or other waste materials shall be disposed of on the mining site or adjacent property; 13. The use of fertilizers, pesticides and herbicides shall not be allowed within 50 feet of an active pit when the geotechnical/hydrological report shows evidence of potential contamination; 14. All plats, short plats, development permits, and building permits issued for development activities on, or within 500 feet of, lands designated mineral resource lands, contain a notice that the subject property is within or near designated mineral resource lands on which a variety of commercial activities may occur that are not compatible with residential development for certain periods of limited duration. (Ord. C-725 § 5, 2010; Ord. C-675 § 178, 2008) A. Reclamation plans shall include: 1. A specification of the amount of material to be left between the aquifer high water mark and the final grade of the reclaimed site; 2. Provisions will be provided for limiting access to and activities within the rehabilitated site until the use of the land is changed. B. In order to ensure further use of land classified as mining subsequent to the removal of native materials, the following provisions covering land rehabilitation or reclamation shall be conformed to: 1. In rehabilitated gravel pits above an aquifer, uses may be very limited or specifically conditioned when new uses are requested for the property; 2. Upon the exhaustion of minerals or materials in the mining zone, or upon the permanent abandonment of the quarrying, mining, or processing operation, all buildings, structures, apparatus, or appurtenances accessory to the quarrying or mining operation shall be removed or otherwise dismantled to the satisfaction of the City of Airway Heights (if so required by the City). (Ord. C-725 § 6, 2010) No density requirements apply in the I-2 zone, except for those areas within the Fairchild Air Force Base accident potential zones defined in Chapter 17.16 AHMC. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 179, 2008) A minimum lot size of 15,000 square feet shall apply in the I-2 zone. A minimum street frontage of 100 feet is required. (Ord. C-675 § 180, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 35 feet from the property line or 65 feet from the centerline; 2. Rear yard – 15 feet; 3. Side yard – five feet per story except for attached buildings; 4. Corner yard – 20 feet from the property line or 50 feet from the centerline. B. Industrial uses that abut any residential zone shall have a minimum setback of 65 feet and shall meet minimum landscaping requirements provided in Chapter 17.22 AHMC. C. The Technical Review Committee may alter these setback guidelines if a design is proposed that differs from these standards, but still provides the same level of safety and aesthetics as intended by these setbacks. (Ord. C-675 § 181, 2008) A. The maximum building coverage shall be 60 percent of the lot area. B. No building hereafter erected or structurally altered in a restricted industrial zone shall exceed three stories or a maximum height of 50 feet above the mean ground level. (Ord. C-675 § 182, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 183, 2008) Signage standards for uses in the I-2 zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. (Ord. C-675 § 184, 2008) Fence and wall standards for uses in the I-2 zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 185, 2008) Landscaping standards for uses in the I-2 zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. (Ord. C-675 § 186, 2008) Storage standards for uses in the I-2 zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. (Ord. C-675 § 187, 2008) All industrial activities shall be carried on in such a manner and with such precautions against fire and explosion hazards as are acceptable to the State Fire Marshal. (Ord. C-675 § 188, 2008) All methods of sewage and industrial waste treatment and disposal shall be approved by the Spokane County Regional Health District, and shall be acceptable to the Spokane County Air Pollution Control Authority. (Ord. C-675 § 189, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1713.html#17.13"
    },
    {
      "name": "   Airport Overlay Zone",
      "description": "17.15.010 Purpose and intent. 17.15.020 Applicability. 17.15.030 Exemptions. 17.15.040 Airport overlay zone boundaries. 17.15.050 General use restrictions. 17.15.060 Height restrictions. 17.15.070 Compatibility use categories. 17.15.080 Airport overlay compatible uses. 17.15.090 Limited use standards. 17.15.100 Development standards. A. The purpose of the airport overlay zone is to protect the viability of the Spokane International Airport as a significant resource to the community by requiring compatible land uses and densities, reducing hazards to lives and properties, and ensuring a safe and secure flying environment, consistent with federal aviation regulations. B. The overlay zone is in addition to existing zoning districts. Where the overlay zone and/or portions thereof are shown outside of the current City limits it is meant to be advisory to adjacent jurisdictions until such time as said areas may be annexed into and become part of the City. C. The airport overlay zone modifies the density and land use standards of the underlying zoning districts. These modifications provide protection to the public, health, safety, and general welfare of the community, airport users, and citizens working and residing within the airport overlay zone. (Ord. C-960 § 3, 2021) The provisions of this chapter shall apply to all lands, buildings, structures, natural features, or uses located within those areas that are defined by the airport overlay zone designated on the official zoning map unless otherwise exempted pursuant to AHMC 17.15.030, Exemptions. Provided, the provisions of this chapter shall have not regulatory effect in areas located outside of the City until such time as said areas may be annexed into and become part of the City. (Ord. C-960 § 4, 2021) Necessary aviation facilities, air navigation facilities, airport visual approach or aircraft arresting devices, meteorological devices, aviation industry related maintenance, aviation training and education facilities approved by the Federal Aviation Administration (FAA) or the Department of Defense, for which the location and height are fixed by their functional purpose, are exempt from the provisions of the airport overlay zone when permitted in the underlying zoning district; provided, that the use will not penetrate the Federal Aviation Regulations (FAR) Part 77 surfaces, attract wildlife that is hazardous to aviation, impact airport operations, or create a safety impact as determined by the airport director. (Ord. C-960 § 5, 2021) In order to carry out the purpose and intent of the airport overlay zone as set forth above, and to restrict those uses which may be hazardous to the operational safety of aircraft operating to and from airports within the City of Spokane and Spokane County, the following airspace and land use safety areas are established: A. Spokane International Airport Overlay Zone. 1. Surface Overlay Zones. a. Five airport land use airport compatibility zones (ACZ) are based upon Washington State Department of Transportation (WSDOT) Division of Aviation guidelines. These are further based on federal aviation accident data from the National Transportation Safety Board (NTSB) and FAA and are shown on the airport overlay zone map maintained by the Planning Department. b. Airport Noise Zone. Those areas within 1,000 feet of where it has been determined that existing or potential noise levels exceed 65 LdN (day-night average sound level). The Planning Department maintains the official map that shows where substantial noise impact areas occur or are anticipated and shall be amended when conditions change or as new information becomes available. 2. Airspace Overlay Zones. Federal Aviation Regulations Part 77 establishes civil airport imaginary surfaces for the regulation of airspace surrounding airports. These imaginary surfaces and any revisions made thereto are adopted by reference and made an official part of this chapter. The size of each imaginary surface is based on the category of each runway according to the type of approach available or planned for that runway. The slope and dimensions of the approach surface applied to each end of a runway are determined by the most precise approach existing or planned for that runway end. The Planning Services Department shall make available to the public upon request up-to-date maps and descriptions of the FAR 77 Civil Airport Imaginary Surfaces. (Ord. C-960 § 6, 2021) A. No use shall be made of any land in the airport overlay zone that would cause any one of the following circumstances: 1. The use creates or causes interference with the operations of radio or electronic facilities at the airport or with radio or electronic communications between the airport and aircraft. 2. The use makes it difficult for pilots to distinguish between airport lights and other lights. 3. The use results in glare in the eyes of pilots using the airports. 4. The use impairs visibility in the vicinity of the airport. 5. The use creates thermal plumes hazardous to aircraft. 6. The use endangers the landing, taking off, or maneuvering of aircraft. 7. The use creates a wildlife attractant that, in the opinion of the airport director, could interfere with aircraft operations. 8. The use would create a fire accelerant or secondary explosion resulting from an aircraft crash in a surface overlay zone. B. The following restrictions also apply: 1. Prior to the issuance of a building or land use permit in any of the surface overlay zones defined herein, the awarding of an avigation easement by the property owner(s) to the appropriate airport(s) shall be required and recorded with the Spokane County Auditor’s office. 2. Prior to the issuance of a permit that requires SEPA review or any Type II land use permit within the surface overlay zones, a copy of the proposal shall be routed to the appropriate official(s) at Spokane International Airport for review and comment. 3. In all cases, the filing of an FAA Form 7460-1 (or any other appropriate federal forms necessary to comply with federal airport laws) with the FAA Northwest Mountain Region may also be required, based on the overall height, location, and/or nature of the proposed construction as directed by CFR Part 77.13. (Ord. C-960 § 7, 2021) Structures or vegetation shall not be constructed, altered, maintained, or allowed to grow into any airspace overlay zone as defined in AHMC 17.15.040(A)(2) and (B)(2). Where an area is covered by more than one height limitation, the more restrictive limitation shall prevail. No structure shall be erected so high as to increase the Federal Aviation Administration landing and/or approach and/or departure minimums for aircraft using the runways of the affected airports, unless the airport operator approves of such action. The following items are exempt from this provision: A. Any structure or object that would be shielded by existing permanent structures or by natural terrain or topographic features of equal or greater height. B. Any air navigation facility, airport visual approach or landing aid, aircraft arresting device, or meteorological device of a type approved by the Federal Aviation Administration, or an appropriate military service at military airports, with a fixed location and height. C. Structures necessary and incidental to airport operations. D. Administrative Height Exceptions. The Planning Director may, as part of a development permit application process, administratively grant height exceptions after a review of the proposal and issuance of written findings that the proposed development meets the following criteria: 1. The applicant has complied with the Federal Aviation Administration Form 7460-1 review process (Notice of Proposed Construction or Alteration) and provided documentation from FAA that this review process is complete and that FAA has no objections to the proposed development. 2. The other requirements of this chapter have been satisfied. Further, the development shall meet at least one of the following criteria: a. The improvement would be shielded by an adjacent or nearby existing permanent structure or natural terrain feature of equal or greater height compared to the proposed structure. b. The improvement is an air navigation facility, airport visual approach or landing aid, aircraft arresting device, or meteorological device, of a type approved by the Federal Aviation Administration. c. The proposal is a military service and support improvement, with a fixed location and height which are necessary and incidental to base operations as certified in writing by the Fairchild Air Force Base. The Director may require an applicant to provide such technical documentation and illustrations necessary to demonstrate that the proposed development will not threaten or reduce aircraft safety. 3. The following items are exempt from this provision: a. Any structure or object that would be shielded by existing permanent structures or by natural terrain or topographic features of equal or greater height. b. Any air navigation facility, airport visual approach or landing aid, aircraft arresting device, or meteorological device, of a type approved by the Federal Aviation Administration. c. Structures necessary and incidental to airport operations. d. Incinerator(s) and/or associated structure(s) owned and/or operated by a municipal corporation and/or political subdivision, either individually or jointly. (Ord. C-960 § 8, 2021) A. This section classifies land uses and activities into use categories on the basis of common characteristics that are potentially compatible or incompatible with both civil and military airports. Uses that put people in harm’s way, increase the risk or severity of an aircraft accident, endanger public infrastructure, or reduce the long-term functionality and economic viability of the region’s civil and military aviation facilities are considered incompatible. B. Uses Not Listed. Examples of uses that are included in the use category are provided. The names of uses on the lists are generic. They are based on the common meaning of the terms and not on what a specific use may call itself. For example, a use whose business name is “wholesale liquidation” but that sells mostly to consumers would be considered a retail sales use rather than a wholesale sales use. As such it would be in the high-intensity uses category rather than the low-intensity uses category. This is because the actual activity on the site matches the description of the retail sales and service category. A use may not be listed but may have the same incompatible characteristics as a listed use. The Planning Services Director may determine that a proposed use has similar incompatible characteristics as other uses that are permitted or not permitted in the respective airport overlay zone, and therefore should also be permitted or not permitted. C. Accessory Uses. Accessory uses are permitted only when they would be permitted as a standalone use. For example, in a zone that prohibits a daycare but allows an office use, a daycare would not be allowed as an accessory use. Except that an office that is accessory to a use in the low-intensity uses category may be permitted pursuant to subsection (D)(6) of this section. D. Use Categories. 1. Residential Uses. Residential uses are considered incompatible because in addition to safety concerns they are sensitive to noise impacts. Examples of residential uses include group living, single-family residences, duplexes, apartments, condominiums, manufactured home and mobile home parks. This does not include hotels and motels in which occupancy is arranged for time periods less than one month. 2. High-Intensity Uses. High-intensity uses are uses that have the potential to concentrate a large number of people in a small area. These uses are considered incompatible because of their potential to put a large number of people in harm’s way. Examples of high-intensity uses include religious institutions, theaters, auditoriums, arenas, concert halls, amphitheaters, lodges, meeting halls, fraternal organizations, gymnasiums and exercise facilities, skating rinks, bowling alleys, arcades, batting cages, community centers, universities, museums, public libraries, funeral homes, arenas, outdoor amphitheaters, outdoor spectator sports, racetracks, speedways, amusement parks, splash pads, campgrounds, fairgrounds, zoos, circuses, carnivals, eating and drinking establishments, farmers markets, retail sales and services, malls and shopping centers, hotels, motels, auctions, offices, labor intensive manufacturing, bus and rail passenger terminals, and mass shelters. 3. Vulnerable Occupant Uses. Vulnerable occupant uses are uses in which a majority of occupants are children, elderly, or disabled or other people who have reduced ability or are unable to respond to emergencies or get out of harm’s way. Examples of vulnerable occupant uses include daycare centers, family daycares, schools (grades K-12), hospitals, other health care facilities where anesthesia is used or patients remain overnight, correctional facilities, retirement homes, nursing homes, and convalescent facilities. 4. Critical Community Infrastructure. Critical community infrastructure includes facilities that the damage or destruction of which would cause significant adverse effects to public health and welfare beyond the immediate vicinity of the facility. Examples of critical community infrastructure include police stations, fire stations, emergency communication facilities, power plants, and waste water treatment facilities. 5. Hazardous Uses. Hazardous uses are uses that release discharge into the air such as smoke, steam, or particulates that impair air visibility, uses that have aboveground storage or uses that require the storage of large quantities of hazardous (flammable, explosive, corrosive, or toxic) materials that have the potential to exacerbate an aircraft accident, or uses that attract wildlife hazardous to aircraft. Examples of hazardous uses include aboveground chemical or fuel storage exceeding household quantities, mining, rendering plants, slaughter houses, stock yards, and feed lots. 6. Low-Intensity Uses. Low-intensity uses do not concentrate people or hazardous material into small areas, are not sensitive to loud noise and do not directly or indirectly inhibit aviation operations. Examples of low-intensity uses include agricultural uses (that do not attract wildlife hazardous to aviation operations), kennels, animal clinics, motorcycle, automotive, truck, marine craft, manufactured home and travel trailer sales (except for auctions), commercial parking, quick vehicle service, maintenance and repair shops, towing services, taxicab terminals, wholesale sales, ministorage, warehouses, nonlabor intensive manufacturing, printing and publishing, cemeteries, trails, rail lines, roads, underground utilities. Low-intensity uses may include a small accessory office in which on-site uses are managed. Larger offices in which business involves matters not related to uses on site are considered high-intensity uses even when combined with a use that is in the low-intensity uses category. (Ord. C-960 § 9, 2021) A. Permitted Uses (P). Uses permitted in the airport overlay zone are listed in Table 17.15.080-1 with a “P.” These uses are allowed if they comply with these standards and other standards of this chapter and are permitted in the underlying zone. When airport overlay zones overlap the proposed use must be permitted in every overlay zone that applies to the subject property or the use is not permitted. B. Limited Uses (L). Uses permitted that are subject to limitations are listed in Table 17.15.080-1 with an “L.” These uses are allowed if they comply with the limitations as listed in the footnotes following the table and the development standards and other standards of this chapter and are permitted in the underlying zones. The subsections in AHMC 17.15.090 contain the limitations and correspond with the bracketed [ ] footnote numbers from Table 17.15.080-1. C. Conditional Uses (CU). Uses that are allowed if approved through the conditional use review process are listed in Table 17.15.080-1 with a “CU.” These uses are allowed provided they comply with the conditional use approval criteria for that use, the development standards and other standards of this chapter and are permitted in the underlying zones. Uses listed with a “CU” that also have a footnote number in the table are subject to the standards cited in the footnote. The conditional use review process and approval criteria are stated in AHMC 17.03.100, Conditional uses. D. Uses Not Permitted (N). Uses listed in Table 17.15.080-1 with an “N” are not permitted. Existing uses in categories listed as not permitted are subject to the standards of AHMC 17.03.170, Nonconforming uses.   Where a maximum density is specified it is the intent of these provisions to prohibit large numbers of people concentrated into a small area and that no portion of a site shall be permitted to be developed into facilities that contain occupancy capacity for more than the number of people specified per acre. Except that in some instances, after consulting with airport personnel, the Planning Services Director may make a determination that a clustering of density will make the proposed use more compatible with airport operations because of the location of flight patterns. A. Residential Living. This regulation applies to all parts of Table 17.15.080-1 that have a note [1]. 1. In the airport noise zones and ACZ-2 and ACZ-3 one single-family home is permitted on each existing lot where the underlying zoning is R-1, R-2 and R-3. Residential uses are not permitted where the underlying zoning is commercial or industrial. More than one residential unit may be permitted in the R-2 and R-3 zones. The density shall not exceed the existing average density on the adjoining properties. The average density of the adjoining properties shall be calculated by dividing the combined number of residential units on all the adjoining properties by the combined acreage of the adjoining properties excluding property dedicated as right-of-way. Subdivisions that result in additional residential lots or zoning changes that allow for further densification are not permitted after the adoption date of this chapter. 2. Residential uses are permitted in ACZ-5 only when the underlying zoning is R-1, R-2 and R-3 except that mobile and manufactured home parks are not permitted. Residential uses are not permitted where the underlying zoning is commercial or industrial. B. High-Intensity Uses. This regulation applies to all parts of Table 17.15.080-1 that have a note [2]. 1. In ACZ-2 religious institutions, funeral homes, libraries, non-aviation-related museums, fraternal organizations, and entertainment oriented uses (amusement park, bowling alley, theater, stadiums, and arenas, etc.) are not permitted. Sales and services oriented uses, eating and drinking establishments, offices, hotels, and motels are allowed when permitted by the underlying zoning at a net density not exceeding 40 persons per acre calculated by dividing the building code occupancy of all structures on the site by the acreage of the subject site not including property that has been dedicated as right-of-way. 2. In ACZ-3 religious institutions, funeral homes, libraries, non-aviation-related museums, fraternal organizations, and entertainment oriented uses (amusement park, bowling alley, theater, stadiums, and arenas, etc.) are not permitted. Sales and services oriented uses, eating and drinking establishments, offices, hotels, and motels are allowed when permitted by the underlying zoning at a net density not exceeding 70 persons per acre calculated by dividing the building code occupancy of all structures on the site by the acreage of the subject site not including property that has been dedicated as right-of-way. 3. In ACZ-4 airport uses and associated activities such as offices, restaurants and eateries serving airport users are the only high-intensity uses permitted when allowed in the underlying zone. 4. In ACZ-5 non-aviation-related museums, horse racing tracks, speedways, stadiums, and arenas are not permitted. All other high-intensity uses are allowed when permitted by the underlying zoning at a net density not exceeding 180 persons per acre calculated by dividing the building code occupancy of all structures on the site by the acreage of the subject site not including property that has been dedicated as right-of-way. C. High-Intensity Uses. This regulation applies to all parts of Table 17.15.080-1 that have a note [3]. High-intensity uses are allowed when permitted by the underlying zoning except for religious institutions, libraries, and outdoor amphitheaters. D. Vulnerable Occupants Use. This regulation applies to all parts of Table 17.15.080-1 that have a note [4]. Uses with vulnerable occupants may be allowed when permitted in the underlying zone at a net density not exceeding 180 persons per acre calculated by dividing the building code occupancy of all structures on the site by the acreage of the subject site not including property that has been dedicated as right-of-way. Except that retirement homes, nursing homes, convalescent facilities, assisted living residences, community care facilities, daycares, preschools, hospitals and schools (grades K-12) are not permitted. E. Critical Community Infrastructure. This regulation applies to all parts of Table 17.15.080-1 that have a note [5]. Police, fire stations, and ambulance service uses are allowed when permitted in the underlying zone. No other critical community infrastructure is permitted. F. Sound Insulation Requirements. This regulation applies to all parts of Table 17.15.080-1 that have a note [6]. Structures intended for human occupancy shall be designed to achieve an interior noise level not exceeding 45 decibels. G. Hazardous Uses. This regulation applies to all parts of Table 17.15.080-1 that have a note [7]. 1. Mining may be permitted in ACZ-2 and ACZ-3 with Type II conditional use permit if the Hearing Examiner, after consulting airport, finds that the proposed mining operation will not create a hazard for aviation operations. 2. Hazardous uses may be permitted in ACZ-5 with Type II conditional use permit if the Hearing Examiner, after consulting airport, finds that the proposed use will not create a hazard for aviation operations or significantly exacerbate an aircraft accident. H. ACZ-1. This regulation applies to all parts of Table 17.15.080-1 that have a note [8]. No aboveground structures or utilities are permitted. Except that on lots existing prior to the adoption of this chapter the minimal structures necessary to allow for reasonable and economically viable use of the property may be permitted when the director determines that the structure(s) would not threaten public health, safety, or welfare on or off the property. The inability of the applicants to derive an economically viable use shall not be the result of actions by the applicant in subdividing the property, adjusting boundary lines or other land use activity thereby creating the undevelopable conditions after the effective date of this chapter. (Ord. C-960 § 11, 2021) The following standards shall apply to all development within the airport compatibility zones 1 through 5: A. Stormwater facilities shall be designed in compliance with the Washington State Department of Transportation Aviation Stormwater Design Manual – Best Management Practices. B. Buildings and structures shall be clustered to either side of the extended runway center line to the greatest extent possible. C. Utilities lines shall be sited underground to the greatest extent possible in airport compatibility zones 1 through 4. (Ord. C-960 § 12, 2021)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1715.html#17.15"
    },
    {
      "name": "   Planned Unit Development (PUD) Overlay Zone",
      "description": "17.17.000 Authorization. 17.17.010 Purpose and intent. 17.17.020 Preliminary PUDs. 17.17.030 Final PUDs. 17.17.040 Phasing. 17.17.050 Installation of improvements. 17.17.060 Permitted uses. 17.17.070 Accessory uses. 17.17.080 Access to development. 17.17.090 Development standards. 17.17.100 Density. 17.17.110 Minimum lot area. 17.17.120 Minimum frontage. 17.17.130 Minimum yards. 17.17.140 Maximum building coverage and height. 17.17.150 Parking standards. 17.17.160 Signage standards. 17.17.170 Landscaping standards. 17.17.180 Storage standards. 17.17.190 Refuse storage. 17.17.200 Mechanical equipment. 17.17.210 Utilities. 17.17.220 Street design flexibility. 17.17.230 Required open space. 17.17.240 Design criteria. 17.17.250 Public transit. There may be situations in which the basic provisions of this title may be modified to permit the improvement of land by what is known as a planned unit development (PUD). The Planning Commission may, after giving notice as required by law and holding a public hearing, recommend approval of a PUD and apply conditions of approval for performance and improvements. Planned unit developments (PUDs) shall be permitted in residential zones unless otherwise stated in this title. All PUDs shall conform to the subdivision requirements of AHMC Title 16. (Ord. C-675 § 220, 2008) It is intended that a PUD be used as an overlay zone in conjunction with the underlying zone to permit a greater degree of flexibility and diversification in the design of a development. Preservation of unique site features and open space is one function of a PUD. Other characteristics include, but are not limited to, private parks, private streets, pedestrian pathways, lighting, fencing, entry sign/monumentation, and landscaping. (Ord. C-675 § 221, 2008) A. PUDs shall be initiated by the owner of all property involved if under one ownership, or by joint application of all owners having title to all the property in the area proposed for PUD. B. The PUD process consists of two phases, a preliminary phase and a final phase. A preliminary PUD includes a site development plan illustrating the concept of the development and uses to be allowed. The decision by the Planning Commission to approve a preliminary PUD shall be binding. This preliminary phase shall not be construed as to render the final PUD inflexible. Said approval is valid for a five-year period, which may be extended up to three years by determination of the City Planner. Any extension of time must be requested by the applicant, in writing, prior to expiration of the original approval, stating specific reasons for such a request. C. The preliminary PUD application shall include all the requirements for a preliminary plat application contained in AHMC 16.03.030, 16.03.040, and 16.03.050, and shall be processed in accordance with AHMC Title 14, Development Code Administration. In addition, a complete PUD application shall include a PUD narrative and a PUD map, which shall include but is not limited to the following: 1. All proposed improvements that are to be constructed on the land and their locations, including, but not limited to, all residential and nonresidential structures, building heights, recreational facilities, site plans and information showing walls, fences, refuse areas, streets, sidewalks, and public transit facilities; 2. Common open space areas indicating size, grades, and functions upon completion;  3. Floor plans of typical dwelling units, the unit size in square feet, and the amount of private, noncommon open space in square feet; 4. Locations and dimension of all off-street parking facilities, public and private, including public transit and park and ride lots; 5. Locations and sizes of all public and semipublic sites, if applicable (i.e., schools, churches, parks, etc.); 6. A tabulation of the percentage of total building coverage in the development; 7. A tabulation of densities within each project area, phase, or sector; 8. Building elevations showing typical architectural styles to be constructed; 9. A schematic landscaping plan indicating the type and the size of plant material to be used and the method for providing permanent maintenance to all planted areas and open spaces; 10. A proposed phasing plan and/or timing schedule, if applicable. (Ord. C-675 § 222, 2008) A. Before expiration of the preliminary PUD, approval of the final PUD is required. Approval of the final PUD shall be administrative unless the Planning Commission, at the preliminary PUD hearing, determines a public hearing on the final PUD is required as a condition of final approval. A final PUD differs from the preliminary PUD in the amount of detailed information provided. The final PUD shall include all the requirements for a final plat contained in Chapter 16.05 AHMC, including approved road plans and drainage systems, assurance of building and fire code compliance, and those requirements and conditions applied to preliminary PUD approval. Any PUD not finalized before the expiration of the preliminary PUD approval shall become void. Construction shall not commence until a PUD has been given final approval. B. No major changes in the approved final PUD, such as rearrangement of lots, blocks, streets, building locations, development standards, or other such changes, may be made subsequent to final development plan approval except upon application to the Planning Department and consideration by the Planning Commission. (Ord. C-675 § 223, 2008) A. A PUD may be developed in phases or increments, subject to an approved phasing schedule. A master phasing plan shall be submitted with the preliminary PUD for approval by the City Planner. The phasing plan may be approved provided: 1. It includes all land identified in the legal description for the project; 2. The phasing sequence is identified by a map; 3. Each phase has reasonable public or private infrastructure to support the number of dwelling units contained within that phase; 4. The unfinalized portion meets the minimum lot size of the underlying zone for the proposed use, or as further provided under this chapter; and 5. The City approves the necessary documents so that all road improvements required are assured for that phase. B. A phasing plan may be amended following preliminary PUD approval. The amended phasing plan may be approved by the City Planner provided the above criteria are met. (Ord. C-675 § 224, 2008) Following approval of a preliminary PUD by the Planning Commission, and before administrative approval of the final PUD, the applicant shall complete minimum improvements in accordance with the provisions of Chapter 16.04 AHMC by one of the following methods: A. By furnishing the City with a performance bond, satisfactory to the City Attorney, in which assurance is given the City that the installation of the minimum improvements will be carried out as provided in this chapter, Chapter 16.04 AHMC, and other City ordinances, and according to the specifications of the City Engineer, within three years from the date the final PUD is approved by the City Planner: 1. The City Council may grant a one-year extension beyond the required three years if the applicant furnishes an extension to the performance bond, satisfactory to the City Attorney; B. By actual installation of improvements in accordance with the provisions of this chapter and in accordance with the installation requirements and under the supervision of the City Engineer; C. By a combination of these methods. (Ord. C-675 § 225, 2008) In the PUD overlay zone, no building, structure, or improvements shall be erected, constructed, converted, established, altered, or enlarged, nor shall any lot or premises be used except for those uses specifically permitted in the following zones: A. Single-family residential zone (R-1); B. Manufactured housing zone (RM); C. Duplex residential zone (R-2); D. Multiple-family residential zone (R-3). (Ord. C-675 § 226, 2008) Within a PUD, all accessory uses, buildings, and structures are allowed in conformance with this title and the underlying zone in which the PUD is located. (Ord. C-675 § 227, 2008) The major internal streets serving each PUD shall be functionally connected to at least one minor arterial or collector street as defined in the Airway Heights Public Works Standards. The streets connecting with any PUD, regardless of the zone in which it is located, must be of sufficient size and character to accommodate the traffic generated by the project, without significantly altering the character of existing residential neighborhoods. Evaluation of the proposal pursuant to this title shall include consideration of the following criteria: A. The increase of traffic which will be generated by the development; B. The existing width and condition of streets to be affected; C. The presence or absence of improved sidewalks; D. Potential impacts upon the value of surrounding properties; E. The anticipated impact upon availability of parking; F. The existence of a particular conflict between vehicular and pedestrian traffic; G. The street type designated by the Public Works Standards. (Ord. C-675 § 228, 2008) Prior to the issuance of a building permit, evidence of compliance with the provisions of AHMC 17.17.100 through 17.17.250 shall be provided to the Planning Department. (Ord. C-675 § 229, 2008) A. In any PUD, the number of dwelling units per acre of land shall not exceed that permitted by the underlying zone, except as approved for density bonus by the Planning Commission. Residential bonus density shall be determined by using the following formula: Net development factor x number of units allowed in underlying zone + bonus density earned = total units permitted. The net development factor is the total acreage of the PUD minus the area set aside for, or existing in, any of the following: 1. Churches and schools; 2. Commercial and/or industrial uses; 3. Single-family residential platted area, if determining net development factor for the multifamily portion of a mixed, single-family/multiple-family development; 4. Natural water bodies, including lakes, streams, swamps, marshes, and bogs which are not incorporated in the common open space plan of the PUD; 5. Seventy-five percent of areas having slopes which exceed 40 percent; 6. Public streets. B. The following units per acre may be cumulatively earned as additional density to the base unit density of the underlying zone: 1. Common Open Spaces. a. Three-tenths unit per acre bonus if at least 10 percent of the dry, common open space has a slope of 10 percent or less; b. Three-tenths unit per acre bonus if significant recreation areas are developed and equipped with such features as, but not limited to, trails, landscaped open areas, pools, tennis courts, children’s play areas, etc. 2. Environmental Concerns. a. Fifteen one-hundredths unit per acre bonus if on-site drainage control is accomplished through integrating facilities into the usable common open space or common recreation area; b. Fifteen one-hundredths unit per acre bonus if significant general public access is provided to a lake or river, one-tenth unit per acre bonus to trails; one-tenth unit per acre bonus to scenic viewpoints. 3. Internal Circulation and Parking. a. One-tenth unit per acre bonus if the off-street parking is 50 feet or less from the entrance to the building served; if one can walk under cover from structure to parking, the parking may be up to 150 feet away and still receive the bonus; b. Two-tenths unit per acre bonus if one-half of the required parking is covered; three-tenths unit per acre bonus if all the required parking is covered; c. Fifteen-one-hundredths unit per acre bonus if parking areas are kept small (10 to 20 spaces in a group) and interspersed with landscaping, or provided within or under main buildings; d. Fifteen-one-hundredths unit per acre bonus if provisions are made for an internal bikeway, physically separated from, and not adjacent to, heavy auto traffic facilities. 4. Public Service and Facility Availability. a. Fifteen-one-hundredths unit per acre bonus if public transit is available within one-quarter-mile walking distance of the majority of dwelling units and offices; b. Fifteen-one-hundredths unit per acre bonus if off-site convenience shopping facilities are functionally accessible within reasonable walking distance (approximately one-half mile); c. One-tenth unit per acre bonus if sewer and water lines lie within, or are adjacent to, the site at the time of application, and the sewer district and water district indicate that their systems will not be stressed by the added development; d. Fifteen-one-hundredths unit per acre bonus if the primary means of access to the project is via an arterial; e. One-tenth unit per acre bonus if the development provides a crime prevention plan, incorporating locks, dwelling unit lighting, street lighting, doors, windows, and alarms, approved by the City of Airway Heights Police Department, if such crime prevention plan is not in conflict with other applicable laws and ordinances; f. One-tenth unit per acre bonus if the project is located within a portion of a school district which that district has identified as a preferred enrollment growth area, consistent with that district’s five-year planning objectives; g. Fifteen one-hundredths unit per acre bonus if integrated special facilities and a program to encourage and facilitate use of public transit and other ride-sharing (e.g., van/carpooling) are incorporated into the design and operation of the project (e.g., sheltered, lighted waiting/loading facilities, including benches; posted and distributed schedule/route information; park-and-ride spaces; carpool matching programs; subscription bus service; bus passes incorporated in monthly maintenance charges). This effort must be approved by the Planning Department in consultation with the Spokane Transit Authority (STA); h. Two-tenths unit per acre bonus if the applicant uses a design/development team, consisting of an architect, engineer, landscape architect, land surveyor, and builder, through the design and construction phases of the project; i. Fifteen-one-hundredths unit per acre bonus if the development features a mix of housing types with at least 10 percent of the total dwelling units being detached single-family dwellings. Detached single-family residences; attached single-family residences; duplexes; townhouses and apartments are examples of housing types. C. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 230, 2008) Each lot used for residential purposes shall have a minimum area of 800 square feet, unless the underlying zone(s) specifically sets minimum lot areas for residential purposes in a PUD. (Ord. C-675 § 231, 2008) Each lot used for residential purposes shall have a minimum width of 30 feet with 30 feet minimum frontage on a public or private street, or pedestrian access, unless the underlying zone(s) specifically sets minimum frontage for residential purpose in a PUD. (Ord. C-675 § 232, 2008) Except when otherwise approved at time of PUD hearing, minimum setbacks of the underlying zone shall apply to exterior project boundaries. Interior yards shall be as approved on the PUD site development plan. Each development will be reviewed to ensure adequate provision of light and air for all structures. (Ord. C-675 § 233, 2008) A maximum of 60 percent of the site may be used for building coverage, exclusive of right-of-way dedications. Building height maximums of the underlying zone may be waived on an individual building to allow greater flexibility with the development. Consideration shall be given to adjacent land uses and building heights, as well as building relationships within the development. (Ord. C-675 § 234, 2008) Parking standards for uses in a PUD overlay zone shall be as provided in Chapter 17.21 AHMC. (Ord. C-675 § 235, 2008) Signage standards for uses in a PUD overlay zone shall be as provided in Chapter 17.23 AHMC. (Ord. C-675 § 236, 2008) A schematic landscape design must be submitted with the preliminary PUD application. Landscaping standards for uses in a PUD overlay zone shall be as provided in Chapter 17.22 AHMC. (Ord. C-675 § 237, 2008) Storage standards for uses in a PUD overlay zone shall be as provided in Chapter 17.25 AHMC. (Ord. C-675 § 238, 2008) All outdoor trash, garbage, and refuse storage areas shall be screened on all sides from public view and, at a minimum, be enclosed on three sides with a five-and-one-half-foot-high concrete block, masonry wall, or sight-obscuring fence with a sight-obscuring gate for access. (Ord. C-675 § 239, 2008) All rooftop mechanical equipment shall be placed behind a permanent screen, completely restricted from view. (Ord. C-675 § 240, 2008) All utilities shall be underground unless deemed impractical because of conditions such as terrain. The power or phone companies involved in the PUD shall be the prime factor for whether or not the City Planner will allow for the change in the utilities. All changes in the utilities are subject to review by the City Planner and Planning Commission. (Ord. C-675 § 241, 2008) A. Within a PUD project, private street pavement widths may be reduced to 20 feet for one-way traffic, or 22 feet for two-way traffic; if all the following conditions are fulfilled: 1. On-site parking shall be provided which is functionally convenient to planned dwelling units, and which is at least equal to the zone requirement plan; one-half stall per unit for guest parking; 2. One-way streets or loop streets with one access point shall serve no more than 30 units and be no more than 1,500 feet long; one-way streets shall be signed at every intersection; 3. On-street parking shall be prohibited; 4. Privately owned and maintained “no parking” or “fire lane” signs shall be required; 5. Roadway horizontals and vertical alignment shall be consistent with Airway Heights Public Works Standards; 6. Assurance of permanent maintenance of private streets and parking areas shall be provided by the landowners, unless otherwise provided by a homeowners’ association through protective covenants maintained by legal means by the group or organization; 7. All areas which are to be occupied or traveled over by motor vehicles shall be paved; 8. All streets shall have sidewalks and be compliant with current ADA (American Disabilities Act) regulations; 9. All streets, parking areas, and facilities shall be compliant with current ADA (American Disabilities Act) regulations. B. Drainage. A drainage plan shall be required consistent with the Airway Heights Public Works Standards. C. Pedestrian Circulation Facilities. Within PUD projects, pedestrian circulation facilities serving each unit shall be provided in accordance with the following criteria: 1. Paved with asphalt, concrete, or Portland cement; 2. Safely convenient to each dwelling unit served; 3. Functionally and safely convenient to schools and to industrial, commercial, recreational, and utility areas within or adjacent to the project, and functionally convenient to a larger pedestrian circulation system outside the PUD; 4. Sufficiently wide (minimum of six feet) to accommodate the potential uses; 5. Located and designed in accordance with approval from the City Engineer; and 6. All facilities and services will be compliant with current ADA (American Disabilities Act) regulations. D. All streets, parking areas, and facilities shall be lighted. All light poles shall be made of metal. (Ord. C-675 § 242, 2008) A. A minimum of 10 percent of total area of the PUD shall be reserved as common open space. The applicant shall choose one or any combination of the following three methods of administering common open space: 1. Dedication of common open space to the City, which is subject to formal City acceptance; 2. Establishment of an association or nonprofit corporation of all property owners or corporations within the project area to ensure perpetual maintenance of all common open space; 3. Retention of ownership, control, and maintenance of all common open space by the applicant. All privately owned common open space shall continue to conform to its intended use and remain as expressed in the final PUD plan by the inclusion in all deeds of appropriate restrictions to ensure that the common open space is permanently preserved according to the final PUD plan. The deed restrictions shall run with the land and are for the benefit of present as well as future property owners of the PUD and shall contain a prohibition against future divisions or segregations without further City approvals. B. All common open space, as well as public and recreational facilities, shall be specifically included in the phasing schedule and be constructed and fully improved by the applicant at an equivalent or greater rate than the construction of structures. C. A minimum of 200 square feet of private open space shall be provided per residential unit. (Ord. C-675 § 243, 2008) The aforementioned development standards contained in AHMC 17.17.100 through 17.17.230 are intended to accomplish the following design criteria objectives in all PUDs: A. Open spaces, pedestrian and vehicular circulation facilities, parking facilities, and other pertinent amenities shall be an integral part of the landscape, and particular attention shall be given to the retention of natural landscape features of the site; B. The layout of structures and other facilities shall effect conservation in street and utility improvements; C. Recreational areas (active and passive) shall be generally dispersed throughout the development and shall be easily accessible from all dwelling units. (Ord. C-675 § 244, 2008) All developments located within the public transit benefit area requiring 20 or more parking spaces shall provide bus loading and shelter facilities if so required by the Planning Department in consultation with the Spokane Transit Authority (STA). (Ord. C-675 § 245, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1717.html#17.17"
    },
    {
      "name": "   Public Zone (P)",
      "description": "17.30.010 Established. 17.30.020 Purposes and intent. 17.30.030 Permitted uses. 17.30.040 Conditional uses. 17.30.050 Prohibited uses. 17.30.060 Development standards. 17.30.070 Density. 17.30.080 Minimum lot area and frontage. 17.30.090 Minimum yards. 17.30.100 Building coverage and height. 17.30.110 Parking standards. 17.30.120 Sign standards. 17.30.130 Fence and wall standards. 17.30.140 Landscaping standards. 17.30.150 Storage standards. There is established the public zone and the standards and regulations by which certain land uses may be permitted therein. (Ord. C-675 § 352, 2008) The purpose of the P zone is to implement those elements of the Comprehensive Plan which deal with community facilities and services. The P zone is intended to provide for the siting and maintenance of publicly owned facilities and institutions. All proposals for rezoning shall be consistent with the goals and policies of the Comprehensive Plan. The P zone is intended for an urban neighborhood setting with public services, improved streets, and public water and sewer systems. For existing facilities, the P district shall be applied accordingly. For new facilities, the P district shall be applied in conjunction with an application for site plan review. (Ord. C-675 § 353, 2008) The land uses permitted in the P zone are listed in the zoning matrix and generally described as follows: A. Governmental Offices and Administration/Maintenance Facilities. The executive, legislative, judicial, administrative and regulatory activities of local, state, federal, and international governments or special districts that may perform public services and work directly with citizens. B. Public and Private Schools. Educational services provided by public, private, or parochial institutions. Examples include grade schools, community colleges, public and private colleges or universities. C. Community and Cultural Services. Establishments primarily engaged in the provision of services that are strongly associated with community, social, or public importance. Examples include libraries, museums, art galleries, performing arts theaters, and community clubs and organizations. D. Post Office. Mailing services provided by the United States Postal Service or contractors, including branch post offices, contract stations, terminals, and distribution centers. (Ord. C-675 § 354, 2008) In accordance with AHMC 17.03.100 through 17.03.140, an approval may be granted for the following uses in the P zone, when satisfied that the use will conform to the Comprehensive Plan and not have any material adverse effect on neighboring properties: A. Religious services involving public assembly such as those that customarily occur in synagogues, temples, and churches. B. Social Services. Establishments primarily engaged in the provision of services that are strongly associated with meeting basic needs. Examples include clothing banks, food banks, temporary shelters, and counseling services. (Ord. C-675 § 355, 2008) All uses not specifically permitted are prohibited. (Ord. C-675 § 356, 2008) Prior to the issuance of a building permit, evidence of compliance with AHMC 17.11.060 through 17.11.140 shall be provided to the Planning Department. (Ord. C-675 § 357, 2008) No density requirements apply in the P zone, except for those areas within the Fairchild Air Force Base accident potential zones defined in Chapter 17.16 AHMC. Proposed land uses within accident potential zones must comply with the population density guidelines outlined in the air installation compatible use zone (AICUZ) study prepared by Fairchild Air Force Base. (Ord. C-675 § 358, 2008) No minimum lot size shall apply in the P zone. A minimum street frontage of 60 feet is required. (Ord. C-675 § 359, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet per story; 4. Corner yard – 15 feet. B. The Technical Review Committee may alter these setback guidelines if a design is proposed that differs from these standards, but still provides the same level of safety and aesthetics as intended by these setbacks. (Ord. C-675 § 360, 2008) A. The maximum building coverage shall be 60 percent of the lot area. B. The maximum building height shall be 50 feet above the mean ground level. (Ord. C-675 § 361, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. (Ord. C-675 § 362, 2008) Signage standards for uses in the P zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. P standards will equal those provided for as in a C-1 zone. (Ord. C-675 § 363, 2008) Fence and wall standards for uses in the P zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 364, 2008) Landscaping standards for uses in the P zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. P standards will equal those provided for as in a C-1 zone. (Ord. C-675 § 365, 2008) Storage standards for uses in the P zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. P standards will equal those provided for as in a C-1 zone. (Ord. C-675 § 366, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1730.html#17.30"
    },
    {
      "name": "   Recreational Zone (R)",
      "description": "17.31.010 Purpose and intent. 17.31.020 Permitted uses. 17.31.030 Conditional uses. 17.31.040 Prohibited uses. 17.31.050 Development standards. 17.31.060 Minimum yards. 17.31.070 Building coverage and height. 17.31.080 Parking standards. 17.31.090 Sign standards. 17.31.100 Fence and wall standards. 17.31.110 Landscaping standards. 17.31.120 Storage standards. It is the intent of this chapter to: A. Protect and preserve certain areas of land devoted to recreational use; B. Provide for the social needs of the community as those needs relate to open space, whether publicly or privately sponsored; C. Enhance the identity and image of the community as a desirable place for human growth and development; D. Provide opportunities and facilities for the various activities and needs of a diverse and dynamic population; E. Provide and protect parks, open space and other natural, physical assets of the community to improve the aesthetic and functional features of the community. (Ord. C-675 § 368, 2008) Principally permitted uses are limited to indoor paintball, health and fitness clubs and facilities, raceway parks, and other similar uses deemed compatible with the general character and stated purpose of the district. Any other use that is determined by the planning staff to be of the same general character as the above permitted uses and in accordance with the stated purpose of the district is permitted. (Ord. C-675 § 369, 2008) A. Essential public facilities. B. Schools. C. Casino/off-track betting. (Ord. C-675 § 370, 2008) Uses other than those identified or described in AHMC 17.31.020 are prohibited. (Ord. C-675 § 371, 2008) Development standards shall take into account both the environmental impact of the proposed use and the design standards of this chapter. Permitted uses as well as similar or related and conditional uses shall comply with the standards of this land use district. (Ord. C-675 § 372, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet per story; 4. Corner yard – 15 feet. B. The Technical Review Committee may alter these setback guidelines if a design is proposed that differs from these standards, but still provides the same level of safety and aesthetics as intended by these setbacks. (Ord. C-675 § 373, 2008) A. The maximum building coverage shall be 60 percent of the lot area. B. The maximum building height shall be 50 feet above the mean ground level. (Ord. C-675 § 374, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. The City planning staff shall make determinations as warranted by the specifics of the proposal. (Ord. C-675 § 375, 2008) Signage standards for uses in the R zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. Standards will equal those provided for as in an I-1 zone. (Ord. C-675 § 376, 2008) Fence and wall standards for uses in the R zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 377, 2008) Landscaping standards for uses in the R zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. Standards will equal those provided for as in an I-1 zone. (Ord. C-675 § 378, 2008) Storage standards for uses in the R zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. Standards will equal those provided for as in an I-1 zone. (Ord. C-675 § 379, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1731.html#17.31"
    },
    {
      "name": "   Open Space Zone (OS)",
      "description": "17.32.010 Purpose and intent. 17.32.020 Permitted uses. 17.32.030 Conditional uses. 17.32.040 Prohibited uses. 17.32.050 Development standards. 17.32.060 Minimum yards. 17.32.070 Building coverage and height. 17.32.080 Parking standards. 17.32.090 Sign standards. 17.32.100 Fence and wall standards. 17.32.110 Landscaping standards. 17.32.120 Storage standards. It is the intent of this chapter to: A. Protect and preserve certain areas of land devoted to existing and future use for civic, cultural, educational and similar facilities; B. Provide for the social needs of the community as those needs relate to open space, whether publicly or privately sponsored; C. Enhance the identity and image of the community as a desirable place for human growth and development; D. Provide opportunities and facilities for the various activities and needs of a diverse and dynamic population; E. Provide and protect parks, open space and other natural, physical assets of the community to improve the aesthetic and functional features of the community. (Ord. C-675 § 381, 2008) A. Specific types of permitted uses are those which provide a public need as described in AHMC 17.32.010, Purpose and intent. Uses shall also be appropriate to the specific site and the intent behind each site’s designation as OS. OS sites designated as the result of a sensitive area designation should only be used for natural resource conservation purposes with associated trails for passive recreation opportunities or such active recreation opportunities as the City concludes is appropriate to the protection, conservation and use of such area. OS sites designated as such for reasons other than sensitive area classification may be used for such other purposes as allowed in the AHMC. Such uses include but are not limited to the following: 1. Parks, greenbelts and open space for active or passive recreation or enjoyment. (Note: whenever a park or open space is created as an integral part of a subdivision, such park or open space shall be designated an open space district on the official zoning map); 2. Those accessory structures to the open space use (bathrooms, tool sheds, picnic structures or playgrounds) are permitted uses. Parking lots and amphitheaters are permitted uses but do not affect development coverage. (Ord. C-675 § 382, 2008) In accordance with AHMC 17.03.100 through 17.03.140, the Planning Commission may grant approval for the following uses when satisfied that the use will conform to the Comprehensive Plan and not have any material adverse effect on neighboring properties: A. Wireless telecommunications support towers. (Ord. C-675 § 383, 2008) Uses other than those identified or described in AHMC 17.32.020 are prohibited. (Ord. C-675 § 384, 2008) Development standards shall take into account both the environmental impact of the proposed use and the design standards of this chapter. Permitted uses as well as similar or related and conditional uses shall comply with the standards of this land use district. (Ord. C-675 § 385, 2008) A. Minimum setback requirements from lot lines are as follows: 1. Front yard – 25 feet; 2. Rear yard – 10 feet; 3. Side yard – five feet per story; 4. Corner yard – 15 feet. B. The Technical Review Committee may alter these setback guidelines if a design is proposed that differs from these standards, but still provides the same level of safety and aesthetics as intended by these setbacks. (Ord. C-675 § 386, 2008) A. The maximum building coverage shall be 10 percent of the lot area. B. The maximum building height shall be 35 feet above the mean ground level. (Ord. C-675 § 387, 2008) Off-street parking spaces shall be provided in accordance with the requirements of Chapter 17.21 AHMC. The City planning staff shall make determinations as warranted by the specifics of the proposal. (Ord. C-675 § 388, 2008) Signage standards for uses in the OS zone shall be provided in accordance with the requirements of Chapter 17.23 AHMC. Standards will equal those provided for as in a C-2 zone. (Ord. C-675 § 389, 2008) Fence and wall standards for uses in the OS zone shall be provided in accordance with the requirements of Chapter 17.20 AHMC. (Ord. C-675 § 390, 2008) Landscaping standards for uses in the OS zone shall be provided in accordance with the requirements of Chapter 17.22 AHMC. Standards will equal those provided for as in a C-2 zone. (Ord. C-675 § 391, 2008) Storage standards for uses in the OS zone shall be provided in accordance with the requirements of Chapter 17.25 AHMC. Standards will equal those provided for as in a C-2 zone. (Ord. C-675 § 392, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1732.html#17.32"
    },
    {
      "name": "   Hayford Road Overlay Zone",
      "description": "17.36.010 Purpose. 17.36.020 Areas where permitted. 17.36.030 Prohibited uses. 17.36.040 Conditional use criteria. The purpose of this chapter is to encourage commercial developments, including strip malls in support of the raceway track. (Ord. C-675 § 417, 2008) The Hayford Road overlay abuts the tribal land to the south, Hayford Road to the east, Deno Road to the north and about 1,500 square feet to the west from Hayford Road. (Ord. C-675 § 418, 2008) Any use not listed under the permitted uses in the underlying zone or accessory uses is prohibited in an overlay district unless authorized in the zoning matrix. (Ord. C-675 § 419, 2008) The following criteria shall be met for conditionally allowed uses in the district: A. The proposed use shall support the goals, policies and objectives of the Airway Heights Comprehensive Plan. B. The proposed use shall promote retail uses, including strip malls supporting the raceway track, and recreational activities in general. (Ord. C-675 § 420, 2008)",
      "link": "https://www.codepublishing.com/WA/AirwayHeights/#!/AirwayHeights17/AirwayHeights1736.html#17.36"
    }
  ],
  "https://library.municode.com/wa/albion/codes/code_of_ordinances": [
    {
      "name": "CRITICAL AREAS OVERLAY (CAO) DISTRICT",
      "description": "16.14.010 - Purpose, intent and applicability.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe purpose of this section is to designate, classify and protect the functions and values of critical areas in a manner consistent with state law while allowing for reasonable use of private property. By adopting this section, the town of Albion acknowledges that critical areas provide a variety of important biological and physical functions that benefit the community and its residents or may pose a threat to human safety or property.\nThe critical area overlay zone consists of that area within two hundred feet of designated wetlands (as designated in the national wetlands inventory), aquifer recharge areas, critical wildlife habitat (as identified by the U.S. Fish and Wildlife Service, the National Marine Fisheries Service, the Washington Department of Fish and Wildlife, the Department of Natural Resources and the Washington Conservation Commission), frequently flooded areas (within Zone A as shown on National Flood Insurance Program maps) or geologically hazardous areas (as identified by the U.S. Geological Survey and the Department of Natural Resources). Any development proposed on a parcel of land within the critical area overlay zone shall be subject to project review as required in this section unless specifically exempted.\n(Ord. 329 §2(part), 2005).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.14CRAROVCADI"
    },
    {
      "name": "R-1 SINGLE-FAMILY RESIDENTIAL DISTRICT",
      "description": "16.16.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe following uses are permitted in the R-1 district:\nOne or two family dwellings, including mobile homes with running gears removed and on permanent foundation, eight hundred square feet or more per dwelling unit, not less than eighteen feet at narrowest width (principal portion of building);\nParks, playgrounds and similar uses.\n(Ord. 139 §1, 1976: Ord. 96 Art. VIII §1(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.16SIMIREDI"
    },
    {
      "name": "R-2 RESIDENTIAL DISTRICT",
      "description": "16.20.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe following uses are permitted in the R-2 district:\nAny use permitted in R-1 residential;\nBoarding or rooming houses;\nParking facilities;\nLibraries and museums;\nLodges and clubs;\nRetirement homes;\nPublic offices;\nDwelling units and mobile homes four hundred square feet or more of single structure.\n(Ord. 96 Art. VIII §2(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.20REDI"
    },
    {
      "name": "R-3 RESIDENTIAL MOBILE HOME DISTRICT",
      "description": "16.24.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe following uses are permitted in the R-3 district:\nAny use permitted in R-1 and R-2 residential and mobile home parks.\n(Ord. 96 Art. VIII §3(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.24REMOHODI"
    },
    {
      "name": "3 district:",
      "description": "16.24.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe following uses are permitted in the R-3 district:\nAny use permitted in R-1 and R-2 residential and mobile home parks.\n(Ord. 96 Art. VIII §3(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.24REMOHODI_16.24.050LOREFOARLOREDI"
    },
    {
      "name": "C COMMERCIAL DISTRICT",
      "description": "16.28.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe permitted uses in the C district are those permitted in the R-l and R-2 districts.\n(Ord. 96 Art. VIII §4(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.28CCODI"
    },
    {
      "name": "I INDUSTRIAL DISTRICT",
      "description": "16.32.010 - Permitted uses.\nSHARE LINK TO SECTION\nPRINT SECTION\nDOWNLOAD (DOCX) OF SECTIONS\nEMAIL SECTION\nThe permitted uses in the I district are those permitted in the R-1, R-2 and R-3 districts.\n(Ord. 96 Art. VIII §5(part), 1971).",
      "link": "https://library.municode.com/wa/albion/codes/code_of_ordinances?nodeId=TIT16ZO_CH16.32IINDI"
    }
  ],
  "https://algona.municipal.codes/": [
    {
      "name": "L Low Density Residential District",
      "description": "22.20.010\nIntent.\nThe R-L low density residential district is intended to stabilize and preserve low density residential neighborhoods; to prevent intrusion by incompatible land uses; to conform to the systems of services available; to provide for community facilities that will enhance residential quality; to allow low-density multiple-family residences interspersed within single-family neighborhoods to limit densities to those for which a complete range of services can be efficiently provided. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.20.020\nPermitted uses.\nPermitted uses in the R-L low density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 11; Ord. 1054-12 § 1; Ord. 817 § 2, 1996). 22.20.030\nAccessory building and uses.\nThe following are not to occupy more than ten percent of the lot area in the R-L low density residential district:\nA. Private garage or carport;\nB. Noncommercial greenhouses and storage sheds;\nC. Private structures to provide shelter for animals;\nD. Uses normally incident to single residences;\nE. Restriction for accessory buildings (see AMC 22.20.055 for yard restrictions):\n1. Shall occupy not more than ten percent of lot area,\n2. Shall be not less than five feet from lot line. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.20.040\nConditional uses.\nConditional uses in the R-L low density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 11; Ord. 1054-12 § 2; Ord. 817 § 2, 1996). 22.20.050\nProhibited uses.\nProhibited uses in the R-L low density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.20.055\nDevelopment standards.\nMinimum front yard\n25 feet1\nMinimum side yard\n5 feet 1, 3\nMinimum rear yard\n25 feet 2\nMinimum street setback, garage or carport\n20 feet\nMinimum lot area\n8,000 square feet4\nMinimum lot width\n80 feet\nMinimum lot depth\n100 feet\nMaximum lot coverage\n45%\nMaximum height\n25 feet\nMinimum street frontage\nN/A\nMaximum density\n6 dwelling units per acre\n1No structure, including accessory buildings, shall be constructed in the required front or side yard.\n2No structure, including accessory buildings, shall be constructed in that portion of any rear yard adjacent to or within ten feet of any adjoining front yard, adjacent to or within five feet of an adjoining yard, or within fifteen feet of any public street.\n3The sum of two sides must be no less than fifteen feet.\n4The minimum lot area for a duplex shall be ten thousand, eight hundred ninety square feet.\n(Ord. 1190-21 § 2, 2021). 22.20.110\nFences and hedges.\nFences and hedges in an R-L low density residential district shall conform to the heights as specified in AMC 22.62.020. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.20.120\nParking.\nMinimum off-street parking requirements in an R-L low density residential district shall be as specified in Chapter 22.40 AMC. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.20.140\nLandscaping.\nMinimum landscaping requirements in an R-L low density residential district shall be as provided in Chapter 22.60 AMC for conditional use permits. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996).",
      "link": "https://algona.municipal.codes/Code/22.20"
    },
    {
      "name": "M Medium Density Residential District",
      "description": "22.24.010\nIntent.\nThe R-M medium density residential district is intended to allow for a variety of housing types and densities; to help meet the need for a range of affordable housing; and to promote residential development at densities that will allow for pedestrian access to commercial establishments, employment, and parks or recreation opportunities. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 4). 22.24.020\nPermitted uses.\nPermitted uses in the R-M medium density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 12; Ord. 965-05 § 4). 22.24.030\nAccessory building and uses.\nThe following are permitted as accessory and shall occupy no more than ten percent of the lot area, unless otherwise stated, in the R-M medium density residential district:\nA. Private garages or carports;\nB. Noncommercial greenhouses and storage sheds;\nC. Private structures to provide shelter for animals;\nD. Uses normally incidental to residential structures;\nE. Restrictions for accessory buildings (see AMC 22.24.060 for yard restrictions):\n1. Accessory structures shall be no less than five feet from the lot line. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 4). 22.24.040\nConditional uses.\nConditional uses in the R-M medium density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 12; Ord. 965-05 § 4). 22.24.050\nProhibited uses.\nProhibited uses in the R-M medium density residential district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 12; Ord. 965-05 § 4). 22.24.060\nDevelopment standards.\nMinimum front yard\n10 feet1\nMinimum side yard\n5 feet 1\nMinimum rear yard\n15 feet 2\nMinimum street setback, garage or carport\n20 feet\nMinimum lot area\n4,000 square feet3, 4\nMinimum lot width\n50 feet5\nMinimum lot depth\nN/A\nMaximum lot coverage\n65%\nMaximum height\n25 feet6\nMinimum street frontage\n30 feet7\nMaximum density\n12 dwelling units per acre8\n1No structure, including accessory buildings, shall be constructed in the required front or side yard.\n2No structure, including accessory buildings, shall be constructed in that portion of any rear yard adjacent to or within ten feet of any adjoining front yard, adjacent to or within five feet of an adjoining yard, or within fifteen feet of any public street.\n3The minimum lot area for assisted senior living facilities, nursing homes, senior housing, and multiple-family dwellings shall be fifteen thousand square feet.\n4The minimum lot area for a duplex shall be five thousand, five hundred fifty square feet.\n5The minimum lot width for assisted senior living facilities, nursing homes, senior housing, and multiple-family dwellings shall be one hundred fifty feet.\n6The maximum height of a duplex or townhouse shall be thirty-six feet when the living space is stacked over a garage. See Diagram 22.24.060A.\n7The minimum street frontage for flag lots shall be twenty feet. See Diagram 22.24.060B.\n8The maximum density for single-family dwellings shall be eight dwelling units per acre.\nFigure 22.24.060A.\nFigure 22.24.060B.\n(Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 12; Ord. 965-05 § 4). 22.24.080\nFences and hedges.\nFences and hedges requirements in the R-M medium density residential district shall conform to the heights as specified in Chapter 22.62 AMC, Fences, Hedges and Walls. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 4). 22.24.090\nParking.\nMinimum off-street parking requirements in an R-M medium density residential district shall be as specified in Chapter 22.40 AMC, Off-Street Parking and Loading. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 4). 22.24.100\nLandscaping.\nMinimum landscaping requirements in an R-M medium density residential district shall be as provided in Chapter 22.60 AMC, Landscaping. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 4).",
      "link": "https://algona.municipal.codes/Code/22.24"
    },
    {
      "name": "1 Mixed Use Commercial District",
      "description": "22.28.010\nIntent.\nThe C-1 mixed use commercial district is intended to provide a mixture of uses. This means that residential uses are mixed with nonresidential land uses, such as small-scale retail and commercial, office, civic and open space. The purpose of this chapter is to achieve the following:\nA. To broaden the tax base of the community by mixing land uses;\nB. To promote the integration of uses where residential may be a component of a commercial development;\nC. To provide a mix of housing types within the community;\nD. To promote different modes of transportation such as walking, bicycles, transit, and to be less reliant on automobiles; and\nE. To promote retail and service facilities that meet the current and potential need for the community and surrounding area. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.020\nPermitted uses.\nPermitted uses in the C-1 mixed use commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.030\nAccessory uses.\nAccessory uses in the C-1 mixed use commercial district shall be as follows:\nA. Uses normally incidental to the permitted use on the same parcel of land;\nB. Storage and similar uses incidental to commercial uses, but not including warehousing. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.040\nConditional uses.\nConditional uses in the C-1 mixed use commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.050\nProhibited uses.\nProhibited uses in the C-1 mixed use commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.060\nRestrictions and limitations.\nEvery use located in a C-1 mixed use commercial district shall be subjected to the following further restrictions:\nA. All uses shall be conducted within a building. At retail establishments, merchandise or other goods, products, or containers may be displayed outside the building; provided, that the space occupied by such displays of merchandise or goods shall not extend more than eight feet beyond the building line; and provided further, that entrances to the premises shall not be blocked by such displays and shall not occupy portions of the lot normally required for off-street parking purposes. Where such sale is conducted, off-street parking spaces may not be reduced below the minimum requirements of Chapter 22.40 AMC and all entrances to and exits from off-street parking areas and the business building shall be kept clear at all times. Loading and unloading of merchandise shall be done on private property or in such a manner as to minimize interference with vehicular and pedestrian traffic on public rights-of-way or off-street parking areas.\nB. Storage shall be limited to accessory storage of commodities sold at retail on the premises or materials used in the limited fabrication of commodities sold at retail on the premises.\nC. Use of cleaning agents shall be limited to nonflammable and nonexplosive fluids with a flash point above one hundred thirty-eight and one-half degrees Fahrenheit in a closed safety cleaning system.\nD. Any buildings or structures or portions thereof used to house animals in connection with small animal hospitals and clinics shall be soundproofed; the animal runs shall be surfaced with concrete or other impervious material; there shall be no burning of refuse or dead animals; drainage shall be away from adjoining properties.\nE. Activities conducted on the premises shall conform to all applicable federal, state, county and city regulations pertaining to noise, odors, fumes, gases, smoke, vibrations and other environmental factors. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.070\nDevelopment standards.\nMinimum front yard\n5 feet\nMinimum side yard\n5 feet\nMinimum rear yard\n15 feet\nMinimum street setback, garage or carport\n20 feet\nMinimum lot area\n4,000 square feet1, 2\nMinimum lot width\n50 feet\nMinimum lot depth\nN/A\nMaximum lot coverage\n75%\nMaximum height\n35 feet\nMinimum street frontage\n30 feet3\nMaximum density\n12 dwelling units per acre4\n1The minimum lot area for assisted senior living facilities, nursing homes, senior housing, and multiple-family dwellings shall be fifteen thousand square feet.\n2The minimum lot area for a duplex shall be five thousand, five hundred fifty square feet.\n3The minimum street frontage for flag lots shall be twenty feet. See Diagram 22.28.070A.\n4The maximum density for single-family dwellings shall be eight dwelling units per acre.\nFigure 22.28.070A.\n(Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 13; Ord. 965-05 § 5). 22.28.100\nOff-street parking.\nOff-street parking in the C-1 mixed use commercial district shall be provided in accordance with Chapter 22.40 AMC, Off-Street Parking and Loading. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.110\nLandscaping.\nLandscaping in the C-1 mixed use commercial district shall be provided in accordance with Chapter 22.60 AMC, Landscaping. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5). 22.28.120\nSigns.\nSigns in the C-1 mixed use commercial district shall be provided in accordance with Chapter 22.64 AMC, Signs. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 5).",
      "link": "https://algona.municipal.codes/Code/22.28"
    },
    {
      "name": "2 General Commercial District",
      "description": "22.29.010\nIntent.\nThe C-2 general commercial district is intended to provide retailing and other commercial services that serve the large market area surrounding the Algona community. In this respect, the C-2 general commercial district should accommodate conventional retail/commercial development that is typical to urban areas such as shopping centers, small- to large-scale retail establishments or a combination of professional services and retail businesses. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.020\nPermitted uses.\nPermitted uses in the C-2 general commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.030\nAccessory uses.\nAccessory uses in the C-2 general commercial district shall be as follows:\nA. Uses normally incidental to the permitted use on the same parcel of land. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.040\nConditional uses.\nConditional uses in the C-2 general commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.050\nProhibited uses.\nProhibited uses in the C-2 general commercial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.060\nRestrictions and limitations.\nEvery use located in a C-2 general commercial district shall be subjected to the following further conditions, restrictions, and limitations.\nA. All uses shall be conducted within a building except motorized vehicles, recreational products, and marine products. At retail establishments, merchandise or other goods, products, or containers may be displayed outside the building; provided, that the space occupied by such displays of merchandise or goods shall not extend more than eight feet beyond the building line; and provided further, that entrances to the premises shall not be blocked by such displays and shall not occupy portions of the lot normally required for off-street parking purposes. Where such sale is conducted, off-street parking spaces may not be reduced below the minimum requirements of Chapter 22.40 AMC and all entrances to and exits from off-street parking areas and the business building shall be kept clear at all times. Loading and unloading of merchandise shall be done on private property or in such a manner as to minimize interference with vehicular and pedestrian traffic on public rights-of-way or off-street parking areas.\nB. Any repairing done on the premises shall be incidental only, except minor vehicle repair, and limited to custom repairing of the types of merchandise sold on the premises at retail. The floor area devoted to such repairing shall not exceed thirty percent of the total floor area occupied by the particular enterprise, except that the limitations of this subsection shall not apply to light equipment, motorcycle, bicycle, shoe, radio, television, or other small household appliance repair services.\nC. Storage shall be limited to accessory storage of commodities sold at retail on the premises or materials used in the limited fabrication of commodities sold at retail on the premises.\nD. Use of cleaning agents shall be limited to nonflammable and nonexplosive fluids with a flash point above one hundred thirty-eight and one-half degrees Fahrenheit in a closed safety cleaning system.\nE. Any buildings or structures or portions thereof used to house animals in connection with small animal hospitals and clinics shall be soundproofed; the animal runs shall be surfaced with concrete or other impervious material; there shall be no burning of refuse or dead animals; drainage shall be away from adjoining properties.\nF. Activities conducted on the premises shall conform to all applicable federal, state, county and city regulations pertaining to noise, odors, fumes, gases, smoke, vibrations and other environmental factors.\nDevelopment Standards\nMinimum front yard\n15 feet\nMinimum side yard\n5 feet1\nMinimum rear yard\nNone\nMinimum lot area\n6,000 square feet\nMinimum lot width\n60 feet\nMinimum lot depth\n100 feet\nMaximum lot coverage\nN/A\nMaximum height\n35 feet\nMinimum street frontage\nN/A\n1If a side yard abuts a street or right-of-way, it must be fifteen feet.\n(Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.100\nOff-street parking.\nOff-street parking in the C-2 general commercial district shall be provided in accordance with Chapter 22.40 AMC, Off-Street Parking and Loading. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.110\nLandscaping.\nLandscaping in the C-2 general commercial district shall be provided in accordance with Chapter 22.60 AMC, Landscaping. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6). 22.29.120\nSigns.\nSigns in the C-2 general commercial district shall be provided in accordance with Chapter 22.64 AMC, Signs. (Ord. 1190-21 § 2, 2021; Ord. 965-05 § 6).",
      "link": "https://algona.municipal.codes/Code/22.29"
    },
    {
      "name": "3 Heavy Commercial District",
      "description": "",
      "link": "https://algona.municipal.codes/Code/22.30"
    },
    {
      "name": "1 Light Industrial District",
      "description": "22.32.020\nPermitted uses.\nPermitted uses in the M-1 light industrial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.030\nAccessory uses.\nAccessory uses in the M-1 light industrial district shall be as follows:\nA. Temporary buildings for and during construction;\nB. Research and office uses related to a permitted industrial operation;\nC. Utility buildings and storage of equipment;\nD. Caretakers quarters (not more than one per parcel);\nE. Open storage of materials associated with a permitted industrial use. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.040\nConditional uses.\nConditional uses in the M-1 light industrial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 1059-12 § 16; Ord. 817 § 2, 1996). 22.32.050\nProhibited uses.\nProhibited uses in the M-1 light industrial district shall be consistent with Chapter 22.33 AMC, Land Use Table. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.055\nDevelopment standards.\nMinimum front yard\n20 feet1\nMinimum side yard\n7 1/2 feet2, 3, 4\nMinimum rear yard\n10 feet5, 6, 7\nMinimum lot area\nN/A\nMinimum lot width\nN/A\nMinimum lot depth\nN/A\nMaximum lot coverage\n65%\nMaximum height\nNone8\nMinimum street frontage\nN/A\nMaximum density\nN/A\n1Front yard shall be a minimum of thirty feet whenever a lot or parcel in the M-1 zone abuts any street which separates an M-1 zone from any residential zone.\n2Side yard shall be a minimum of fifty feet whenever a lot or parcel in the M-1 zone abuts any lot or parcel in any residential zone.\n3Side yard shall be a minimum of thirty feet whenever a lot or parcel in the M-1 zone abuts any street or alley which separates any M-1 zone from any residential zone.\n4Side yard shall be a minimum of twenty feet whenever abutting any street or right-of-way.\n5Rear yard shall be a minimum of fifty feet whenever a lot or parcel in the M-1 zone abuts a lot or parcel in any residential zone.\n6Rear yard shall be a minimum of eight feet when abutting rail.\n7Rear yard shall be a minimum of thirty feet whenever a lot or parcel in the M-1 zone abuts any street or alley which separates any M-1 zone from any residential zone.\n8When a building exceeds forty-five feet in height, the portion of the building shall set back one foot from each side and rear property line for each one foot the building exceeds forty-five feet in height.\n(Ord. 1190-21 § 2, 2021). 22.32.070\nRequired open spaces.\nAdditional open spaces, both as to amount and location on the premises, may be required in connection with a conditional use permit. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.100\nLandscaping.\nLandscaping requirements in an M-1 light industrial district shall be as specified in Chapter 22.60 AMC. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.110\nSigns.\nSign requirements in an M-1 light industrial district shall be as provided for in Chapter 22.64 AMC. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.120\nParking requirements.\nParking requirements in an M-1 light industrial district shall be as provided for in Chapter 22.40 AMC. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.140\nNoise.\nIn all industrial districts the noise emanating from premises used for industrial activities shall not exceed those limits as set forth in WAC 173-60-040 as presently exists or as hereafter may be amended. (Ord. 1190-21 § 2, 2021; Ord. 908-01 § 1; Ord. 817 § 2, 1996). 22.32.150\nGlare.\nIndustrial and exterior lighting shall not be used in such a manner that produces glare on public highways and neighboring property. Arc welding, acetylene torch cutting or similar processes shall be performed so as not to be seen from any point beyond the outside of the property. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.160\nStorage and handling of inflammables.\nIn terms of fire and safety hazards, the storage and handling of inflammable liquids, liquefied petroleum gases and explosives shall comply with rules and regulations falling under the jurisdiction of the city fire marshal, the laws of the state and other local ordinances. There shall be no bulk storage of inflammable gas. Enameling and paint spraying operation shall be permitted when incidental to the principal operation and when such operations are contained within a masonry building of two-hour fire-restrictive construction. Bulk storage of inflammable liquids below ground shall be permitted and the tank shall be located not closer to the property line than the greatest dimension (diameter, length or height) of the tank. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.170\nElectrical interference.\nProvisions must be made for necessary shielding or other preventive measures against interference occasioned by mechanical, electrical and nuclear equipment, uses or processes with electrical apparatus in nearby buildings or land uses. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.180\nOdor, fume or dust emissions.\nThe emission of noxious odors of any kind shall not be permitted, nor the emission of any toxic or corrosive fumes or gases. Dust created by an industrial operation shall not be exhausted or wasted into the air. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.190\nSmoke and particulate matter emissions.\nA. The emission of smoke or particulate matter of a density equal to or greater than the following numbers on the Ringlemann Chart as currently published and used by the U.S. Bureau of Mines is prohibited at all times: M-1 light industrial, Ringlemann Chart No. 2.\nB. Dust and other types of air pollution borne by the wind from such sources as storage areas and roads shall be minimized by appropriate landscaping, paving, oiling or other acceptable means. Emission of particulate matter in excess of the following weight limitations per cubic foot of conveying gas or air measured at any property line is prohibited: M-1 light industrial, two-tenths grain. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.200\nParticulate matter emission rates.\nThe rate of emission of particulate matter from all sources on any property shall not exceed a net weight per acre of property during any one hour as follows: M-1 light industrial, one pound per acre. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.210\nWaste storage.\nLiquid and solid wastes, storage of animal or vegetable wastes which attract insects or rodents or otherwise create a health hazard shall be prohibited. No waste products shall be exposed to view from eye level from any property line in an M-1 district. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996). 22.32.220\nStorage areas.\nAll storage shall be located within any area not closer than twenty feet from the street right-of-way line and shall be enclosed with a heavy wire fence or a similar-type fence with the top of the fence not to be less than six feet above the adjoining street level, or by an attractive hedge or board fence at least six feet high. In case of the open storage of lumber, coal or other combustible material, a roadway shall be provided, graded, surfaced and maintained from the street to the rear of the property to permit free access of fire trucks at any time. (Ord. 1190-21 § 2, 2021; Ord. 817 § 2, 1996).",
      "link": "https://algona.municipal.codes/Code/22.32"
    }
  ]
}